{"pageProps":{"articleData":[{"pk_df_blog_page_id":1,"blog_content":"<p></p><p>\tIt's almost year ago my journey in Desire started. It began with a nervous interview after which I was unsure of my selection.I got along with people, I was overwhelmed and beyond my expectation this family has given me many things, it has changed me into a better person.I always used to think about those children who are not so fortunate as we are, those children spent their nights on railway platform, find their happiness in the garbage tins, in the dump yards etc as the opportunity is not equally distributed to them. However, being in desire family i learned that it was very easy to think but getting it in action, is all what matters as because, actions speaks louder than words. Instead of just thinking about them here I learned to do things for the betterment of those children and in return getting the most precious gift of SELF SATISFACTION.</p><p>\tSatisfaction of spreading happiness. This family has not just helped me in finding myself, it has transformed an introvert into a team player. It has taught me the importance of leadership, the importance of family, love, happiness, friendship. It has taught me to lend my hand to others who are unable to seek opportunities.</p><p>\tThen comes the WINTER SCHOOL at IIM AHMEDABAD. It was like a dream come true. I had never thought of getting such an opportunity. I spent about one week at IIM with some of the most intellectual mind of the world and got to learn many things from them. Each person there was a source of knowledge and inspiration to me. It was   a wonderful experience for me and these all came true because of the DESIRE FAMILY,  I got the inspiration of helping other without any self-motive, living with those children, enjoying their life, flying in their thought, eating with them, playing with them , finding happiness with them in every little things. This family has completely changed my view about life, about satisfaction, about love, about friendship and made me a better human.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/aditya_karn?igshid=10m7nqq8ninf9","user_facebook":"https://www.facebook.com/aditya.kashyap.3760430","user_linkedin":"https://www.linkedin.com/in/aditya-kumar-797953115/","user_name":"Aditya Kumar","create_timestamp":"2020-08-23T10:35:17.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1GcC8fz7goaup1JL3KZjVCKWPw1IRnwUu"}],"id":"1"},"__N_SSG":true}