{"pageProps":{"articleData":[{"pk_df_blog_page_id":103,"blog_content":"<p>The pandemic struck us very hard and brought the entire mankind down on its knees and  life to a standstill. However, with time we persevered and found new ways to live our life through this pandemic while working from home or attending lectures from home, etc. Although everyone faced difficulties during this pandemic, but for the people belonging to the impoverished sections of the society this pandemic came as a nightmare which they could never have anticipated. We all  have witnessed their plight in the news, from losing their jobs to walking hundreds of kilometers on foot to their homes when all transport services were suspended and a nationwide lockdown was imposed. Many died of hunger, exhaustion and others were left stranded with almost no help in sight. Seeing their plight many people came forward to their help.</p>\n<p>Fast forward to the end of 2020, life is gradually coming back to normalcy . But unlike us who are attending regular online lectures, thousands of children belonging to the weaker sections of the society are unable to avail the means to ensure that their education never stops. They are facing severe financial crisis as their families still bear the brunt of the pandemic. As a result, they are unable to avail the internet plans to attend the online classes, the required stationaries, books and other articles required for their education. For their families to be able to feed their children is a huge task considering their current financial situation. This problem is faced by many children which has ultimately hampered their education. We at Desire Foundation ,want to help these kids get the education which they rightfully deserve. So, we have come up with a project called “Sponsor a Child \"Programme. This project is categorized under our upcoming project Adhyayan 5. Under this program , with the help from sponsors, we aim to sponsor the needy kids and help them overcome some of the barriers faced by them in their education. We believe that with this helping hand, we will be able to give these kids a chance to continue their education without any difficulties.</p>\n<p>So far, we have been able to sponsor the education of 3 kids. But there are many more waiting for help from your side. All they need is a little support from your side so that even if they fall, we have their back and will support them financially in their education. We have come up with various plans of the sponsorship so as to suit the needs of the sponsors and to help them to contribute with ease and as per the amount they want to donate. These plans include monthly, quarterly, half yearly and annual donation for the initiative. After receiving the generous contributions ,our robust system and competent interns with the help of our database will find the kids who need this sponsorship the most and help them. We ensure the smooth and hassle-free deployment of the aid to the kids. The happiness of these kids after receiving the sponsorship will know no bounds. For these kids, this sponsorship signifies an opportunity to receive quality education and to be able to chase their dreams.</p>\n<p>We believe many more contributors will turn up to sponsor the kids and help them resume their education. Together,we can bring a difference into the lives of these children because we have the desire to do good for the society and you too can be a part of our success story. All it needs is a generous contribution from your side.</p>","blog_headline":"Sponsor a Child Program","user_email":"rick.das.private@gmail.com","user_insta":null,"user_facebook":null,"user_linkedin":null,"user_name":"Rohan Das","create_timestamp":"2021-01-04T05:37:49.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1BQKYjiCTyn29c8eFeTXrqY5QeFzpjRHu"}],"id":"103"},"__N_SSG":true}