{"pageProps":{"articleData":[{"pk_df_blog_page_id":104,"blog_content":"<p>“Strength is Life, Weakness is Death.<br>\nExpansion is Life, Contraction is Death.<br>\nLove is Life, Hatred is Death.”<br>\n<i>- Swami Vivekananda</i></p>\n<p><strong>History and Background</strong></p>\n<p>January 12 marks the birthday of Swami Vivekananda, who was a true luminary, credited with enlightening the western world about Hinduism. He was an ardent disciple of Sri Ramakrishna Paramahansa and a major force in the revival of Hinduism in India. He pushed for national integration in colonial India, and his famous speech remains as the one that he gave in Chicago in 1893.</p>\n<p>To honour his many contributions to the country, the government of India, in the year 1984, declared his birthday as National Youth Day, and the day has been celebrated since. On this day, the country’s youth is expected to rise to the values, principles and beliefs that the great monk lived by. As the government rightly said in 1984, “the philosophy of Swamiji and the ideals for which he lived and worked could be a great source of inspiration for the Indian Youth Day.”</p>\n<p><strong>Objective and Celebration</strong></p>\n<p>The main objective is to promote rational thinking among the youth, believed to be the future of the country. It expected of the youth to rise to the occasion, fight for the right and channel their inner energies, just like Swami Vivekananda would have. Numerous functions are organised in schools and colleges, where the young minds are. Speeches, music, recitation and essay-writing competitions, yogasanas, are held on this day. Students are encouraged to tap into their spirituality.</p>\n<p><strong>Role of Youth in Society</strong></p>\n<p>Youth is the backbone of any nation. Youth can play an important role in the development of the society. Pakistan currently is the largest generation of young people ever recorded in its history as 64% of the total population was below the age of 30, and 29% between the ages of 15–30 years. This is the important segment of the society and youth can play a vital role in the development of the country. But this young and able workforce is not being given their chance to shine.</p>\n<p><strong>Problems</strong></p>\n<p>Unfortunately there is lack of opportunities, professional training institutes, awareness for youth in the country. Educated youth is unemployed, they are unable to participate in the country’s development because there is no quality education, and textbooks, policies, and curriculum differ across the country. There is no proper training institute in the country where student can get professional training for their careers.</p>\n<p>Youth is now becoming a depressed segment of society, there are degrees but no jobs, there are universities but no professional education, there are schools but different education systems between elite and poor, there is a government but not a proper policy as to how they can solve these issues. The Government along with the people should realize the situation and take quick measures to save the future of the nation.</p>\n<p><strong>Relevance and Significance</strong></p>\n<p>On the 12th day of January 2021, let us stand together and celebrate the National Youth Day. Let us work hand in hand to solve the prevalent problems to make the world a better place for ourselves and for the future generation. As the theme for the year is “Channelizing Youth power for Nation Building”, let us make sure that our actions speak and we are successful in living upto the values of the great Swami Vivekananda.</p>\n<p><strong>Desire’s Journey with the Youth</strong></p>\n<p>Established in 2013, Desire Foundation is a brainchild of the youth. Young college-goers who wanted to work for the education of the ones in need together set up this organisation. Today, the Foundation is a family of 160 members, tirelessly working and striving towards helping everyone gain equal opportunities in education. The organisation deeply believes in the power of the youth and has successfully undertaken several projects (http://www.desirefoundation.org/projects.html) utilising youth as a resource. Every year, we extend our family with 50+ members and hope to achieve our milestones with their effort.</p>\n<p>\"Be the servant while leading. Be unselfish. Have infinite patience, and success is yours.\"</p>\n<i>- Swami Vivekananda</i>\n","blog_headline":"Power of the Youth","user_email":"ups0408@gmail.com","user_insta":"https://instagram.com/upasana_ghosh?igshid=hld19oug325w","user_facebook":null,"user_linkedin":null,"user_name":"Upasana Ghosh","create_timestamp":"2021-01-12T05:55:16.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1MKVnTqZ7aMqc7V6xHIo4O0Lj_4AC_nat"}],"id":"104"},"__N_SSG":true}