{"pageProps":{"articleData":[{"pk_df_blog_page_id":105,"blog_content":"<p>India celebrates Republic Day every year on 26th January to honour the date on which the Constitution of India came into effect on 26th January 1950 replacing the Government of India Act (1935) as the governing document of India and thus, turning the nation into a newly formed republic.</p>\n<p>Where the mind is without fear and the head is held high;<br>\nWhere knowledge is free;<br>\nWhere the world has not been broken up into fragments by narrow domestic walls;<br>\nWhere words come out from the depth of truth;<br>\nWhere tireless striving stretches its arms towards perfection;<br>\nWhere the clear stream of reason has not lost its way into the dreary desert sand of dead habit;<br>\nWhere the mind is led forward by thee into ever-widening thought and action—<br>\nInto that heaven of freedom, my Father let my country awake<br>\n- Rabindranath Tagore</p>\n<h6><strong>History of Republic Day</strong></h6>\n<p>A draft of the constitution was prepared by the committee and submitted to the Constitution Assembly on 4th November, 1947. Then the Assembly met for 166 days, spread over a period of 11 months and 18 days before adopting the Constitution. After many deliberations and some modifications, the 308 members of the Assembly signed two hand-written copies of the document (one each in Hindi and English) on 24 January 1950. Two days later which was on 26 January 1950, it came into effect throughout the whole nation. </p>\n<h6><strong>Celebrations </strong></h6>\n<p>The Republic Day parade is held in New Delhi and is organised by the Ministry of Defence.Nine to twelve different regiments of the Indian Army in addition to the Navy and Air Force along with their bands, march past in all their finery and official decorations. The President of India, who is the Commander-in-Chief of the Indian Armed Forces, salutes the Indian flag. Twelve contingents of various paramilitary forces of India and police forces also take part in this parade.</p>\n<p>The Beating Retreat ceremony is held after officially denoting the end of Republic Day festivities.It is conducted on the evening of 29 January, the third day after the Republic Day. The bands of the three wings of military: the Indian Army, the Indian Navy and the Indian Air Force, performs in this ceremony. </p>\n<h6><strong>Award Distribution</strong></h6>\n<p>On the eve of Republic Day, the President of India distributes Padma Awards to the civilians of India every year. These are the second highest civilian awards in India after Bharat Ratna. These awards are given in three categories, viz. Padma Vibhushan, Padma Bhushan and Padma Shri.</p>","blog_headline":"Republic Day: The Beginning Of India","user_email":"chattopadhyaysuranjana98@gmail.com","user_insta":"hhttps://www.instagram.com/magikian_/","user_facebook":null,"user_linkedin":null,"user_name":"Suranjana Chattopadhyay","create_timestamp":"2021-01-25T10:34:07.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1iKn5TiOy1INXkGdaBAcYR_4NOA6r2CxJ"}],"id":"105"},"__N_SSG":true}