{"pageProps":{"articleData":[{"pk_df_blog_page_id":116,"blog_content":"<p><strong><em>“History will judge us by the difference we make in the everyday lives of children.” ― Nelson Mandela. </em></strong></p>\n<p></p>\n<p><span style=\"font-size: 18px;\"><strong> Trouble of the hour </strong></span></p>\n<p></p>\n<p>Covid-19 pandemic struck everyone hard in every way possible. If you are able to read this, it goes without saying that you must have some stability in your life. But, spare a moment wondering about those who could barely manage to make their both ends meet, not to mention the adversity posed to them by the pandemic. If we go through the statistics, around 40% of the children who were enrolled in 2020 - 21 dropped out due to the pandemic, only 34.7% student have the means to access online education and nearly 41 lakh people lost their job during pandemic.</p>\n<p></p>\n<p>&nbsp;<span style=\"font-size: 18px;\"><strong>Efforts : Sponsor A Child </strong></span></p>\n<p></p>\n<p>We, at Desire foundation have always strived to weaken the jeopardy of such community. Our project Sponsor A Child is one instance to testify. We all are aware of the online learning system which has grown exponentially since the pandemic hit us, which enabled you to attend classes at the comfort of your home. But, not everyone has the the same luxury. The phase 1 of Sponsor A Child was a massive success as we managed to facilitate this online learning system for 8 children who are more than happily attending their classes now. Well, that is the entire motive of Desire foundation to make the underprivileged learn and trust us, it brings immense joy in our lives to see these little ones grow.</p>\n<p></p>\n<p><span style=\"font-size: 18px;\"><strong> Urge : Your Support</strong></span>&nbsp;</p>\n<p></p>\n<p>We are launching the phase 2 of Sponsor A Child which requires your support and assistance in order to make this phase a bigger success than the phase 1.</p>\n<p></p>\n<p>Do come forward and help us bring joy in someone's life and be a part of the change by clicking the link below-</p>\n<p>&nbsp;<a href=\"https://forms.gle/uDr1uAeW9fkPqPDj9\" target=\"_blank\">https://forms.gle/uDr1uAeW9fkPqPDj9</a>&nbsp;</p>\n<p></p>\n","blog_headline":"Sponsor A Child","user_email":"ramsonshivaditya@gmail.com","user_insta":"https://www.instagram.com/shiv_adi_1611/","user_facebook":"https://www.facebook.com/shivaditya.singh.71","user_linkedin":"https://www.linkedin.com/in/shivaditya-singh-356b061b6/","user_name":"Shivaditya Singh","create_timestamp":"2021-03-25T06:50:07.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1oz5yGpGUpo_uVn1HX-U1u4sPhbnSd0Vh"}],"id":"116"},"__N_SSG":true}