{"pageProps":{"articleData":[{"pk_df_blog_page_id":15,"blog_content":"<p></p><p>\tBenefactress or philanthropist or whatever was called by 'em;</p><p>\tAh-ha! My school friends knew that these words define me so well.</p><p>\tWas a bit nerdy when it came to studies ;</p><p>\tBut certainly was up when was asked to help needy.</p><p>\tCollege life seemed tedious in the very first year;</p><p>\tHad an aspiration to carry on with the same work here.</p><p>\tTo my imagination, the recruitment of ˜Desire' rolled out;</p><p>\tAnd I went for the same when I was a sophomore.</p><p>\tInterview to me seemed a bit quirky ;</p><p>\tNevertheless, seniors sensed my potential and I made it to this family.</p><p>\tThough building the bond with seniors left me quite jittery;</p><p>\tSo here is to the loquacious nature that helped me ultimately.</p><p>\tNow comes the visits that helped me to connect with slum people;</p><p>\tGuess what they said, Oh, Hi, Miss Shivangi! Yes, I have your number, even meeting me after one long year.</p><p>\tHad developed a bond so special with ˜Rita Ma'am', head of those rustic people;</p><p>\tAs she used to wish me things like Dear, A very Happy new year.</p><p>\tThings evolved, I evolved and I saw a drastic change in me growing up as a person;</p><p>\tLittle did I know that seniors selected me to be the next HR coordinator.</p><p>\tGetting designated for this post was, no doubt,  a very big moment for me;</p><p>\tAlso, I knew that with it comes plenty of responsibilities that I will fulfil sincerely.</p><p>\tI still remember how the very first GBM as a coordinator was so special to me;</p><p>\tMore than interns, it was me who was fretting mightily.</p><p>\tSooner or later, I nailed yet another skill;</p><p>\tIt guided me on how to approach people as a team.</p><p>\tAs an HR, I interacted with the entire Desire Family;</p><p>\tThis taught me who to tackle with sternness and whom to handle with serenity.</p><p>\tDesire taught me things that I can't just count on fingertips;</p><p>\tIt also drilled me into setting priorities which is also a big thing.</p><p>\tI have a certain piece of advice to the interns of new time;</p><p>\tPlease spend here some time and you will get a life.</p><p></p>","blog_headline":"Journey from everything new","user_email":null,"user_insta":"https://instagram.com/shivagiii?igshid=1fhujrx9awudn","user_facebook":"https://www.facebook.com/shivangi.adeshara1","user_linkedin":"https://www.linkedin.com/in/shivangi-adeshara-4701a0182/","user_name":"Shivangi Adeshara","create_timestamp":"2020-08-23T10:35:20.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1wZYk9bsAFjOu2PUfNOrP95OG-16K7HUt"}],"id":"15"},"__N_SSG":true}