{"pageProps":{"articleData":[{"pk_df_blog_page_id":19,"blog_content":"<p></p><p>\tMy idea of joining Desire Foundation developed from the time I got admission in this college.Thanks to Instagram posts of some seniors who belonged to my school. From the very first day of applying I was excited. I roped in 5 of my friends for applying and 4 out 5 did get selected!The interview process was not intimidating at all. I initially applied for HR, but ended up being selected for Graphic Designing!Since childhood, I wished to grow up and find myself a work where I could make use of my natural ability to empathize with others and of my strong desire to help people easen their life. That is the reason why even after being finiky about study pressure, I made the decision to indulge in some philanthropic work and channel my energies and efforts into helping those less fortunate than me.</p><p>\tA lot of people asked me back then, When you had the option of selecting so many philanthropic opportunities, why Desire?. I promptly replied Desire focuses on permanent change and not on an ephemeral one-day impact, and when I heard my seniors saying this exact thing on the very first GBM, thats when i knew, that this is going to be my place.College was a wonderful as well as a terrifying experience simultaneously. Wonderful in the sense that I was finally studying something I truly wanted to and terrifying because I had to stay away from home. But after joining Desire my concept of college life thoroughly changed. I made new friends from diverse backgrounds , people I would have never got the opportunity to meet and on top of that seniors who never let you feel lonely and are always there to support!My journey in Desire foundation was quite different than that of other societies , events ,organizations that I had always been a part of.During my first slum visit, my excitement level was on epitome!I reached there before time and was full of enthusiasm! We had to travel really far in order to see the slum and talk to the Slum Head or ward corporator. But even after hours and hours of search we couldn't find the slum nor could we contact the corporator, because he had already left. Even though the visit was futile, the experience wasn't.</p><p>\tMy second slum visit was when I could actually meet the families. They had such hopeful eyes and smiling faces, even after not being able to afford most necessities of life , that it gave us an instant motivation to work even harder and all that tiredness due to long walks and blazing sun just went away in a jiffy.Also, I would like to add that I had always been a girl who didn't step out of my house alone, and had zero road sense and never used a lot of public transports but ,the slum visits here gave me enough confidence to travel alone to new places and shaped my personality. As a graphic designer, i have developed so much and I share my credits with Desire. The work culture here is so professional yet friendly. Be it leadership quality, time-pressure management or professionalism, Desire taught me things, which I could apply not only in my college life, but in my entire journey ahead.</p><p>\tEveryone makes mistakes and I too have made many. But DESIRE never let me feel low but always taught me how to improve upon that.Life throws a lot of challenges our way, some that we had anticipated and many that we had not. In worrying about the future, however, we all too often miss out on the present, but I always keep in the back of my mind the realization that there is a difference between the things I can change and the things I cannot “ and that that's ok.Sometimes when we set out to help others, the experience ends up helping us in turn.I can tell you it is draining at times in a different way. There are times when I have undergone a dilemma. But every time I see the thankful smiles and twinkling eyes I melted. I will tell anyone I come across to first be true to what your heart calls. You will never feel unsuccessful by learning and focusing in an area that fills your spirit with joy. I also found that when i focus on something that creates joy for me, that is when i am truly able to focus on all my challenges.</p><p>\tI can say that I thoroughly enjoyed the experience and it gives me immensely pleasure to be a part of the journey of those kids, their tears and the smile! Despite all the challenges in this field hearing thank you from the families of small kids is enough. Seeing their lives transform for the better is all I want!</p><p></p>","blog_headline":"My desire fueled my journey","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/disha.kar.79","user_linkedin":"https://www.linkedin.com/in/disha-kar-621b13184/","user_name":"Disha Kar","create_timestamp":"2020-08-23T10:35:21.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=13ziu1xF_Jcf4e0NC2apCGEgZX0LaZpn3"}],"id":"19"},"__N_SSG":true}