{"pageProps":{"articleData":[{"pk_df_blog_page_id":20,"blog_content":"<p></p><p>\tSitting on the edge of the mountain of my dreams , thinking about all the new stuffs I will get to do, about my Christmas gifts and birthday gifts, I always thought that life is actually a fairy-tale  where everything is beautiful ,but I never knew that life was unfair to some before I joined Desire Foundation, a government registered trust that works for underprivileged people of the society.</p><p>\tThe first turning point of my life came when I attended my first event, The Holi event in Ashakiran, an orphanage for girls. The day before the event I was sure that we will go there,  tell them to paint something, distribute chocolates and then return back. But next day, after all the hardwork, from finding the right location in the scorching Bhubaneswar heat to persuading the children to sit and paint, when I finally saw the happy faces of the children, I was filled with happiness, content and satisfaction and I knew that I was in the right place.</p><p>\tThe next turning point in my life came when I was made the team leader of our project, Adhyayan. We were supposed to go to a slum and conduct a survey on Right to Education. Seeing the people's lifestyle there, their hardships, made me change my perception towards life. There, I also met a girl who could not speak. She was a bright beautiful and talented girl, who was loved by everyone. Though she couldn't speak but her dance could. She also had a dream like I did, but her dreams were a lot different from mine. She had a dream to speak, to speak her feelings out, let everyone know about her wishes and desires. Her wish was to have enough money so that she can pursue her dreams.</p><p>\tYes, life is not fair to everyone, we are the lucky ones and we should be thankful for that. This short span of my journey in Desire has changed me as a human, changed my thoughts and made me a better person.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/sreyashi.das?igshid=89wig6h88mg1","user_facebook":null,"user_linkedin":null,"user_name":"Sreyashi Das","create_timestamp":"2020-08-23T10:35:21.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1Xf_hsyRmEZ2nw2cV-2AARfIP1SsrOyx_"}],"id":"20"},"__N_SSG":true}