{"pageProps":{"articleData":[{"pk_df_blog_page_id":28,"blog_content":"<p></p><p>\tLast year, winter came with a surprise for me as I found one of my friends distributing copies in every hostel room. I asked her about the details and she told me how she was involved with Desire Foundation and how with the profit made, this very foundation did social work, trying to uplift the living standards of the oppressed and suppressed. I found this whole concept intriguing and requested her to inform me whenever new recruitments would be made.</p><p>\tMy friend, not forgetting to keep my request, told me personally to fill a form for getting a membership in this foundation. The more I went through the details of the division of work between various departments(HR, Sales, Content, Marketing and Creativity), the more interested I became to join the team. The idea of being able to contribute howsoever little to this world kept me from sleeping that night. Anyway, I filled the form and God helped me to get selected for the interview.</p><p>\tIt was just another lazy Sunday morning(31st of July 2016, as I now remember), yet very different from others. I went for the interview, still nervous with butterflies in my stomach. Funny how after reaching the venue(C Block-OAT) all my nervousness and anxiety disappeared and only hope and desire to serve the foundation prevailed.</p><p>\tThat very night I had the satisfaction of knowing that I had been successful in the interview and that I was officially appointed as an intern in Desire Foundation for the years to come. The e-mail I got excited me so much that I forwarded it to all my close friends and relatives. I even got an official appointment letter later(the first of such a kind, yay!) which almost made me dance.</p><p>\tThe first meeting which took place on the 14th of August began with taking a group picture of the entire team, thus seeping into all our hearts the idea of unity and teamwork. We were told to meet the very next day for our first project. It was Independence Day. We went to a school and made the children participate in various competitions. For the first time in twenty years, 15th August seemed this symbolic as I was finally able to contribute at least something for my motherland. Time and again we visited as many children and families as we could, letting people know about the RTE Act and making people aware of the importance of education. We visited slums with our Desire T-shirts on(team spirit again) and went from door to door to talk to everyone. Diwali was a little more luminous than every other year as we again visited a school. Unimaginative as I am, I never thought of being able to be a part of the decoration team. I was made the leader of the team and the inner dead creative part of my soul began to relive its colourful life. With many more projects, reports, copy distribution, each one of us in the team remained connected in a bond “ a bond of having the desire to make this world a better place for you and me.</p><p>\tThis foundation has not only made me more fluent in my work and given me exposure, it has also made me realise and given me the motive to be reborn as a human being- a true human being. I not only feel happier today than I used to a few months back but also am a little more organized, thanks to Desire Foundation. All my inner skills and abilities which I thought never existed found a place in my heart after I joined here. I can now finally answer the question which arises in all our hearts“ If not me, who? If not now, when? If not here, where?</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/baidehi_g?igshid=1nlmqhzalolp5","user_facebook":null,"user_linkedin":null,"user_name":"Baidehi Ghosh","create_timestamp":"2020-08-23T10:35:23.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1xfev-WMMQub_6nl-MMUaAZljNKwN1MR3"}],"id":"28"},"__N_SSG":true}