{"pageProps":{"articleData":[{"pk_df_blog_page_id":36,"blog_content":"<p></p><p>\tMy journey in Desire Foundation started in the year 2014; it was an enriching and wonderful experience throughout. We went to slums interacted with many people, the people who had suffered a lot in their life but still moving ahead with a hope, seeing their will to fight the odds and move ahead in life gave me hope, hope to fight the wrong, hope to live a meaningful life. It has had a great influence on my perceptions on life and I experienced that how happy we can become seeing beautiful smiles on those underprivileged faces .I am pleased to worked in such a friendly environment where each and every member puts whole heart and soul to reach their ultimate goal ” to transform lives of people on the edges of society and living in the most destitute areas.” Desire Foundation impressed me by its organizational structure which is a combination of government registered trust working in a corporate way. Being a part of Human Resource department, conducting events, arranging appointments and dealing with a plethora of individuals and corporate was a great exposure. The organization provided me a platform of not only immense learning but also contributing towards society. It was an overwhelming and life changing experience and I feel grateful to Desire Foundation for giving me this opportunity of working with them.</p><p>\tAt last from my experience I would just like to say that never let your fear become your master, because the point where fear becomes the master is the point where you break.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/purohitsampada?igshid=17knl94uq4zzu","user_facebook":"https://www.facebook.com/profile.php?id=100002579456991","user_linkedin":"https://www.linkedin.com/in/sampada-purohit-77783891/","user_name":"Sampada Purohit","create_timestamp":"2020-08-23T10:35:24.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1KUmoJPy4nld_j298gwnkfVKEPUfI78ao"}],"id":"36"},"__N_SSG":true}