{"pageProps":{"articleData":[{"pk_df_blog_page_id":41,"blog_content":"<p></p><p>\tTThe pen is always mightier than the sword. And so, might is always right. Education is the most powerful medium to express what we have, what we think, what we believe, what we see and what we hear. It is the interface between knowledge and the homo sapien. It is our very own platform which builds a uniform population.When those kids carry bags full of books and pens and walk their way to the school and while they study sitting on the benches, with their friends, and the teachers teaching them and writing on the blackboard, there gets a path to the brightest economy of the country being built.</p><p>\t˜The classroom that we give them is the economy we build for tomorrow.</p><p>\tThe books that we give them is the blocks of the society we build for tomorrow.</p><p>\tThe hand that we give them is the unity we build for tomorrow.</p><p>\tToday is the International Literacy Day. Well, literacy doesnt need any particular day to be celebrated though. Literacy is the light of each lamp. Unfortunately, this light doesnt reach millions. The equal opportunities are being distributed unequally. And it is not because of the privileges that some get but about the mindset that we have. Literacy is not only about being educated but also about having a good mind towards the society as well where it equals our very own humanity.  And when humanity is lost, literacy is worthless. Kerala has the highest literacy rate in India due to one reason- the literates have the capability to create a new set of finitely infinite literates in the country. When one state has the ability to achieve cent percent literacy, then why are the other states behind?  The mindset of being judgemental on the necessities of being educated. The very thought that education is the gift that males get and a curse for the females followed by the question as to what benefit it will give when females get married and their work is in the household chores. When we start searching for the benefits of literacy, that is the time when our thoughts of being educated are blocked.</p><p>\tDo we really need to take an oath to achieve a cent percent literacy for the world? Or do we take an oath to literate ourselves? Literacy needs to be seeped into the roots of humanity and this will be possible only when our own hands nourish it with water and fertilizers. Literacy is achieved at the individual level more than the government being responsible for our own education. If the Government is taking one step forward, it is we who are to take the other step. Goals are achieved when we take steps towards.</p><p>\tWell, last and not the least, a very Happy International Literacy Day.</p><p></p>","blog_headline":"International Literacy Day","user_email":null,"user_insta":"https://instagram.com/sam_2102_sona?igshid=1333fe6oe2l2d","user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/sonali-ankita-575727169/","user_name":"Sonali Ankita","create_timestamp":"2020-08-23T10:35:25.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1Khu9z3w9xtB0D7AdRY_n4ythG1MKtMTv"}],"id":"41"},"__N_SSG":true}