{"pageProps":{"articleData":[{"pk_df_blog_page_id":43,"blog_content":"<p></p><p>\tIt could have happened to me. It could have happened to anyone of us sitting here today. But it happened to her, said the bosom friend of ˜Uyiene Mrwetyane lamenting at her death. She could do nothing but shedding tears after a heinous crime against her confidant, took away her life.</p><p>\tUyiene, a 19-year old, University of Cape Town student, woke up to this date of 24 August 2019, oblivion that this is the very day when she will take her last breath.</p><p>\tShe was to collect her parcel from the post office shortly after 2 pm but was asked to come later as power was cut off. When she returned, a 42-year-old post office worker was the only individual she can see at that place. On the pretext of helping her, he lured her through the dimly lit post office and grabbed her upon the waistline. She could sense the evil in his eyes and tried to run away . But the very moment she stepped forward, she was bludgeoned at her head knocking her unconscious on the floor. She had purportedly fought back with utmost strength but the mighty devil disrobed her, leaving her enveloped in the pool of her blood. After he brutally murdered and raped her, he hid the girls body and walked free for 3 weeks until a prosecutor found the connection between the girls death and this very worker. Later, the man reportedly confessed the crime and indicated to investigators where the body was hidden.</p><p>\tThis incident has sent waves of fear and terror not only in South Africa but also across the globe that there is no hope for women in any part of the world. The worst part is that the crime against women is performed by all those who are meant to protect her. When we talk about India, Delhi and Kerela who are among the most literate states have the highest crime rate against women. In todays era, the only conclusion we can have is that education is no parameter for a person to be ethically and morally sound. We need to understand that just a candle March or protests on the street for a week wont bring any justice to Uyiene who lost her life, a few days ago. Here comes the time when we need to inculcate values in our children, our spouses and our friends to respect women. Nevertheless, its the ethics that rule the world and not violence.</p><p></p>","blog_headline":"It could have happened to me","user_email":null,"user_insta":"https://instagram.com/manikaswiftie?igshid=uvumrlynptid","user_facebook":null,"user_linkedin":null,"user_name":"Manika Sharma","create_timestamp":"2020-08-23T10:35:25.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1OmaakwKg639i_l_aqriJxM9eFQl1OHzp"}],"id":"43"},"__N_SSG":true}