{"pageProps":{"articleData":[{"pk_df_blog_page_id":46,"blog_content":"<p></p><p>\tHey its time to get inside said the hubris incharge of the cage.</p><p>\tIs it just me who want to set my wings free and fly high or is it all my fellow men who are feeling the same way. I argued with my own thoughts which has now become a daily task for me.</p><p>\tMornings never seemed euphoric it is just the same everyday.Do I now even like to wake up? Or is it is just because my hands are tide to my impuissant self.</p><p>\tGet ready Reema your master will be coming to introduce you to his new clients the general manager said.</p><p>\tWhy do I have to do this, just because they provide me with food ..this is so immoral! I argued with the only friend in this dark world.</p><p>\tWe had no one in our life we were born to be the slaves to these rich pockets if we take up arms against them then it will lead everyone into trouble she said.</p><p>\tYou are wrong Swati if we do not find a way out we can never get ourselves freed from this cage.I heard one of the guards talking about us and discussing that capturing any human and slavery without consent is against law and they can get heavily punished if it comes into the notice of the government. I said</p><p>\tI do not know much about law of course we were never given education it is just gods grace that we are alive and feeding our stomach Swati said with teary eyes.</p><p>\tNegative thoughts attracts negativity¦I have decided to talk to the guard,he seems to be a nice person but this can only happen if all the women and men out here cooperate I said.</p><p>\tIt is a risk to your own life as well as everyone who gets involved, you know how powerful the master is lets not involve too many people,we need to work smartly here Swati said.</p><p>\tThe next day I woke up with a little courage and hoped that we might see a day where we can wake and sleep on our own wish,eat and drink of our own choice,read and explore the world whenever we want.</p><p>\tWhile the manager was busy with the days scheduling I silently escaped from the room to talk to the guard standing outside the room.</p><p>\tUncle this is Reema I overheard you one day that whatever master does is against law and there is possibility that we can come out of this hell I said.</p><p>\tWhat are you talking about ?I dont know it and please never ever speak these words it will risk me and my family if the master comes to know about this the guard said.</p><p>\tUncle am I not like your daughter? Arent other women and men in this hell like your daughter and son? I promise in no way it will be revealed that you were involved in it.I have a plan if you say I would just want to share it with you, I said.</p><p>\tHearing to my plan the guard said It seems right and I might help you as I have some acquaintance who can manage it the way you want.</p><p>\tNext day we were all dressed up for the master to come and introduce us to the clients.</p><p>\tA tall muscular man came in looking around all of us sitting in the hall .He scanned the room and then picked me up and said, I will take her but before that I want to have a small talk with her, The tall man said to the master.</p><p>\tI was nervous and went into the balcony with him.</p><p>\tI am from the police department here to help you people out,but before that u need to tell me the entire detail of your master and what all has ever happened which I will be recording in this tape, The tall policeman said.</p><p>\tI kept on narrating the entire story and after about half an hour we came into the room the master smiled and said so do you like her but to his astonishment the reverse happened and the man said I am from police department here to arrest you.How long have you been plying from the life of such innocent people.</p><p>\tThe Police man took the master away and also helped to register each one of us under UN council of our country for our rights of freedom and liberty.</p><p>\tThe rights of every man are diminished when the rights of one man are threatened. John F. Kennedy</p><p></p>","blog_headline":"Manacles","user_email":null,"user_insta":"https://instagram.com/agrawal_aditi_?igshid=1364w4fglbkc7","user_facebook":"https://www.facebook.com/rocking.aditi.96","user_linkedin":null,"user_name":"Aditi Agrawal","create_timestamp":"2020-08-23T10:35:26.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1KjfB9HJK0B1gZXbdcLWKM785ewWt0bKE"}],"id":"46"},"__N_SSG":true}