{"pageProps":{"articleData":[{"pk_df_blog_page_id":50,"blog_content":"<p></p><p>\tThe mind preaches things what the heart doesnt. But, when the mind isnt always able to activate itself, we do not have any other choice but to go with the things that are not meant for the mind to perceive.</p><p>\tAn adult uses only 1 percent of the brain whereas the same is perceived as 2 percent by a childs brain. So, a child understands a lot about the surrounding and the happenings in it. The room for the development begins at the age of 5, when the children start their school life. The mind plays a very important role at this stage and any misleading can lead to any mishap to the child. Psychology of the child is very sensitive to what we teach and what we behave in front of them. As the saying goes- Charity always begins at home. Understanding your children is as important as educating them. The circumference of the child understanding is very narrow and to get inside the circle, one needs to cross that narrow path, the thin line of their imagination and the harsh reality.</p><p>\tChildren, once entering the school, also bring in their curious and innocent minds to the actual world, coming out of their own world. To overcome the imagination is not the actual challenge. Crossing that thin border is what we need to achieve and it, at times, becomes impossible for the matured minds to achieve it. School teaches them the bond of trust and education within the confined walls of safety and security, covering their eyes with a dark cloud of imagination, blocking the path to the outer world. Textbooks teach us the golden words because silence is not always golden does not create a proper space inside a childs mind. These children are the building blocks of our nation. So, channelizing their energy in the right direction and also allowing them to face reality at an early age can help avoid surprises and shocks to the innocent minds.</p><p>\tToo much of everything is not advisable and so too much exposure at an early age is also not acceptable as it can cause damage to the child and the mind. Children are always curious about everything. Right education about reality in homes and schools will help to develop the correct psychology a child can have.</p><p>\tEvery child is special and every child has a special mind. It is the image that is created to sketch a portrait in the childs mind.</p><p></p>","blog_headline":"Perceiving the Psychology","user_email":null,"user_insta":"https://instagram.com/sam_2102_sona?igshid=1333fe6oe2l2d","user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/sonali-ankita-575727169/","user_name":"Sonali Ankita","create_timestamp":"2020-08-23T10:35:27.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1eAk2S7EGZ443tfGA4ZmRSqtyU_-krhoF"}],"id":"50"},"__N_SSG":true}