{"pageProps":{"articleData":[{"pk_df_blog_page_id":55,"blog_content":"<p></p><p>\tNever be afraid to show your true colours they say so. In a society which scoffs at people going against expected norms, transgender people have been derided at every turn and continue being unfairly treated even today. Some people deny them respect and some barely treat them as fellow citizens deserving the same basic rights as everyone else. Even the youth of today wont think twice before using terms like hijras as a way to mock someone.</p><p>\tIn what is a landmark achievement, Kalinga Institute of Social Sciences(KISS) has appointed a transgender woman, Sadhana Kinnar, as a social development officer. Sadhana Kinnar, formely known as Sadhana Mishra, has been working in the field of gender identity, gender discrimination, social mainstreaming of transgenders and development of underprivileged children and women for the past 14 years in Bhubaneswar.</p><p>\tTransgenders, due to lack of being provided their rights and systemic discrimination face several major issues like depression, high suicidal tendencies, higher rates of HIV/AIDS, poverty and even violence. Sadhana has been associated with NGOs helping transgenders like Sakha,HIV/AIDS Alliance and Sathi. Thanking Dr. Achyuta Samanta she said, I am obliged to Samanta for giving me appointment in the KISS. I had an ambition to work in a large organisation like KISS. I can do more work for the empowerment of transgenders through KISS in the coming days. This is a step in the right direction in making sure that the transgender community in the country gain the recognition they deserve so they no longer need to be afraid of showing their true colours. Afterall its the variety that gives a multi-coloured society its beauty. Lets do our part in making sure we help by treating them with the respect that every human deserves.</p><p></p>","blog_headline":"Breaking the stereotype KISS appoints Transgender as social development officer","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/titikhyu.dixit","user_linkedin":"https://www.linkedin.com/in/titikhyu-dixit-13a339156/","user_name":"Titikhyu Dixit","create_timestamp":"2020-08-23T10:35:28.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1CcdCAiQ-ZbO9WecTt6yRm6YexGhR5iGI"}],"id":"55"},"__N_SSG":true}