{"pageProps":{"articleData":[{"pk_df_blog_page_id":57,"blog_content":"<p></p><p>\tUnrest among the citizens, chaos on the streets, lots of protests and even some deaths.</p><p>\tThese seem no wonder to you if you are an Indian. All credit goes to the new Citizenship Amendment Act (Dec 2019) passed by Rajya Sabha followed by the consent of our President, Shri Ram Nath Kovind. Here is the answer to all of your questions regarding this Act.</p><p>\tSo, lets begin with what this Act is actually about?</p><p>\tThis Act provides an opportunity to all the non-Muslim immigrants from 3 Muslim majority countries, i.e., Pakistan, Afghanistan and Bangladesh to acquire the citizenship of India if they happen to reside here in India before 31, December 2014. The citizenship is applied to only Hindus, Sikhs, Parsis, Buddhists, Jains and Christians facing religious persecution in these Muslim majority countries and exempts the people who follow Islam. Moreover, the requirement for them to stay in India has been reduced to five years instead of the previous 11 years before applying for Indian citizenship.</p><p>\tDid you get astonished that as to why are there a lot of protests by Indians themselves?</p><p>\tThere are a significant number of protests carried out by people on the streets and even some have resorted to violence in the name of the same especially in NCR, Kerela and West Bengal. Lets go demographically and head with Assam first.</p><p>\tAssamese seem to protest against this act keeping this ideology in mind that the new immigrants can hamper their linguistic uniqueness but they are oblivious to the very fact that CAA does not apply to the tribal areas of Assam, Mizoram, Tripura and Meghalaya due to their inclusion in Sixth Schedule of the Constitution.</p><p>\tProceeding with the National Capital Region, Majority of the people indulging in protests seem to be minorities, lets look into their reason too. People out there have a mindset that this Act is supposed to take away their citizenship and render them homeless if they fail to produce the documents but the real picture is that this Act does not entail with the Indian citizens and is solely consolidated to immigrants and the same goes with the people of Bengal who share the same doctrine as followed by the protestors in the NCR.</p><p>\tHas any Conclusion been drawn?</p><p>\tWe, as the citizens of a democratic nation, have a right to perform protests if we feel that the decision made by the government fails to adhere to the Constitution but at the same time make sure that while going ahead with it nobody resorts to violence. We being the literate and responsible Indian citizens are accountable to inform the remaining ignorant ones that as to what this Act really is and stop them from believing in rumours.</p><p></p>","blog_headline":"CAA A controversial act with a chaotic roar","user_email":null,"user_insta":"https://instagram.com/manikaswiftie?igshid=uvumrlynptid","user_facebook":null,"user_linkedin":null,"user_name":"Manika Sharma","create_timestamp":"2020-08-23T10:35:28.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1yIaoe6MA7DyFmwFXHiytiPYsMgDeYW3k"}],"id":"57"},"__N_SSG":true}