{"pageProps":{"articleData":[{"pk_df_blog_page_id":6,"blog_content":"<p></p><p>\tI always wanted to be a social worker and desire gave me a platform to live my childhood dream. When I joined desire, I just wanted to be a part of it, rest I didn't know anything about desire. I was extremely happy when I got selected. I still remember my first pre-survey and the struggle to find the slum location. It was so tiring yet it was so much fun. I was an introvert when I joined desire and it taught me to push my limits because it created a difference in someone's life and that was the motivation behind everything. From talking to strangers over the call, selling copies, interviewing people and also giving my first speech as a coordinator all felt like a unique experience. It was because of desire that I got the opportunity to go to IIM Ahmedabad where I met like minded people. Those 4 days were some of the best days of my life and it also made my vision crystal clear about what I wanted to do with my life and I am grateful to desire for the same. I was elated when I was chosen as a slum leader. I still recall that it became personal to me as my sister's name is also Prashanti. I can't explain the happiness in words, when first child of that slum got admitted though I was little disheartened for not being able to see that. Desire introduced me to many friendly seniors  who were always ready to guide me. It taught me that œyaar life me sab selfish nahi hote.Here I also met a special friend who stood beside me during hardships. Though there were some ups and downs, but whenever I needed help, I contacted a member of desire, and therefore it always felt like a family. I will always cherish these moments for the rest of my life. If I have to explain my experience in desire, in a single sentence then I would say œ it's an unforgettable journey!</p><p></p>","blog_headline":"An unforgettable journey","user_email":null,"user_insta":"https://instagram.com/r_s_prasanna_?igshid=o1ktjnzq7zgo","user_facebook":"https://www.facebook.com/prasanna.sharma.900","user_linkedin":null,"user_name":"RS Prasanna","create_timestamp":"2020-08-23T10:35:18.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1DLLFXyeb-6lD2_pMH7W12txmyvIbqWwB"}],"id":"6"},"__N_SSG":true}