{"pageProps":{"articleData":[{"pk_df_blog_page_id":63,"blog_content":"<p></p><p>\tBRD Medical College, Gorakhpur.</p><p>\t10th Aug17</p><p>\tSounds familiar?</p><p>\tThe country caught another cold when 100 children died due to gross administrative negligence, leaving us stunned with the same age-old questions. How long? Whom to blame? What is the remedy?</p><p>\tHow have you reacted to this? Are you unsettled by the fact that it is yet another negligence in the governments duty, amounting to murder? Are you upset at how these deaths have cast a gloom on their families? Most sane minded people are. And do you agree that amidst all this hue and cry, the political parties are putting the ˜blame-ball in their rivals court without an element of remorse?</p><p>\tLet us now sit back and ponder upon a few grey zones.We are a generation continuously striving to make our nation proud and safeguard our dignity.(Ignore the hyperventilating jingoes!).Today Im proud to be part of a generation where an increasing number of people have voiced their concerns on social issues.We all have a patriot in us, a raging one!However, there is no point in being just a symbolic patriot if this cannot be coupled with a substantially working patriot. In a country driven by the shackles of corruption, discord and disharmony, we need to join hands.Not only our armchair realisations but also our actions need to make the noise.</p><p>\tWhat has this got to do with the Gorakhpur incident?</p><p>\tHear folks! The devil is knocking at the door. Such mishaps are slowly infiltrating the society like a cancer. And the ˜Chalta hai, Hota hai attitude is a loud example of an idle and ignorant dialogue. The question that arises now is how do we contribute?</p><p>\tBefore I delve deep into that, let us concentrate on the domain of public health we are focusing upon. Precisely, this deals with the management of rapid spread of infectious diseases (IDs)(more specifically, Vector borne diseases)in rural populations. IDs are one of the most potent threats to human survival in every strata of the society. They get transferred from one person to the other, in a very short span of time through agents known as Vectors (mosquito, flea, etc).What is difficult to prevent is the disease cycle as the vectors have a strong affair with an unsanitary environment which is aplenty in India.</p><p>\t(Quite akin to politicians and the present political playground!).Such a fulminant situation demands prompt measures to eliminate these obnoxious elements. There is a national protocol by the name of NVBDCP that envisages guidelines to maintain proper sanitation and advice relevant immunisations. Meanwhile, there is a government who does not care jackshit about its proper implementation. And even more interestingly, no one is there to monitor how government resources for rural areas are utilised.</p><p>\tThe JE break out at Gorakhpur has been a problem since 1977. 40 years since then, children are still dying in huge numbers. And as for the oxygen crisis, Im sure you have read the entire story and derived how horribly careless a government can be.The valid questions hitherto, are: Was lack of Oxygen supply the only cause of so many deaths and that too in a single ward? Or was it only the encephalitis? Are both these collectively responsible? I believe in the last hypothesis and the fact that 10,000 children have died in the past years due the same disease urges me to shift the spotlight a lot into the cause of a chronic encephalitis outbreak in the same city.</p><p>\tThe blatant reality is, this is not only an isolated incident. Thousands of such massacres are happening all over the country, every day. Nothing has changed.</p><p>\tThere are precisely two major things we can do now. First, more people need to volunteer to educate the illiterate and feed the needy. Make health awareness a dictum for all social work. Diseases crumbling the Indian rural population are mostly infectious and hence awareness and follow up on health, immunisations and hygiene can definitely improve things. (coupled with effective implementation of Disease Control Programmes)This doesnt essentially demand a medical professional. These are simple information that any person with prudence and practicality can understand and make others understand. No matter which profession you belong to, take some time out to serve the people in need, actively.</p><p>\tSecond, more students need to take up medical science. This country needs good doctors now, more than ever. It is a pity that hostile circumstances and the hyped pressure have served as deterrents to most students.However, I urge youngsters to come forth and take this up as a challenge. Service to mankind in his most debilitated times is not only a responsibility but also a privilege.</p><p>\tIt is high time the government sets up even more medical colleges across the country with a proper infrastructure and a reliable management to produce more health professionals. Allied health services need to be given adequate scope for flourishing and more people should join it.Public healthcare should altogether be a separate field of education.Also, incentives need to be given to healthcare providers for serving in destitute areas. Because every human being needs motivation and satisfaction to give his/her best in work.</p><p>\tIt is needless to say what the government needs to do ad hoc. Results of most health programmes have been immensely disappointing as each and every government has failed to tackle the Indian health crisis. Reasons are obvious. Corrupt administrations, the exceedingly low budget allocated to health (presently only 1% of GDP), and most importantly-lack of basic humanity, to name a few.You can go on bashing the government but as we know, it has remained callous and cold-blooded.</p><p>\tYou are probably into an ideological bubble by now and since the world is much more a realistic space, all these may seem far-fetched aspirations. I wont disagree with you. But then, there is always a scope to make reality better. No one expects an ideal world, but it is always commendable when on our personal fronts, we choose to put a few constants that bring realism an inch closer to idealism. Let those constants be our burning desire and untiring efforts to make this country a better place.</p><p></p>","blog_headline":"Rage, rage against the dying of light!","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/shagnik.paul","user_linkedin":null,"user_name":"Shagnik Paul","create_timestamp":"2020-08-23T10:35:29.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1IbWlZ0G9JZ02brklnVUiMFVwTMciAu-q"}],"id":"63"},"__N_SSG":true}