{"pageProps":{"articleData":[{"pk_df_blog_page_id":64,"blog_content":"<p></p><p>\tShe covered her body with her knees and tried to hide her face with her hands.</p><p>\t16th December, 2012 ( 8 PM ); the day that dumbfounded the entire nation; the day that bought tears in the eyes of each and every citizen, the day which is still recorded as the most darkest days of the nation.</p><p>\tThe NIRBHAYA case brought the entire nation together as we fought to give her the justice. The most ugliest thing about this nightmare is that  those criminals are still alive but the young girl stopped breathing.</p><p>\tLet me talk about a few numbers:-</p><p>\tDelhi recorded 27,097 rapes in a single calender year (2013), and the country recorded almost 70,000 in the year 2013. when I look at the current scenario, I dont think this number is going to come down any time soon. Let me take you take you through the most recent case that took place in Hyderabad; a young girl was gang raped and was brutally abused. Her dead body was found the next morning in a miserable condition.</p><p>\tI just want the answers to my questions:-</p><p>\tIndia is a democratic country where the criminals dont get punished for victimizing the people, its a country where girls still fear of getting harassed.</p><p>\tshe died screaming and scratching the rapists faces. And her family will die multiple times while finding justice in the court.</p><p>\tThose screams and tears were left unheard, those minds were left helpless. She might have screamed for help, she might have even tried to run and she might have called you for assistance but you might not have looked into those pitiful eyes. she might not have anymore tears left in her eyes, she might not have anything to share, she might not have anyone to trust and finally she might commit suicide.</p><p>\tAll four accused in Hyderabad veterinarians rape case and murder case killed in a police encounter; This is todays breaking news, right?</p><p>\tWhen I saw these headlines, it filled my heart with a sense of satisfaction but then i looked at the other side of the coin. I am not against this encounter but everything has its pros and cons. The best thing about this encounter is that it would create a sense of fear in the mind of the rapists but on the other side, it also displays the potholes in our Judiciary system. This encounter was done before any official judgment was made; the criminals of Nirbhaya case are still alive, the criminals of recent rape case on a 10 year old girl are still alive, the criminals of the recent rape of a 35 year old woman are not even caught. This depicts the weakness in the judiciary. According to me, RAPE is the most worst crime; so, the judiciary should take these cases very seriously and there shouldnt be any delay in the judgment. The victim should get the justice within a single day and all the rapists should be sentenced to death.</p><p>\tBut it is very disappointing to see hundreds of rapes every week and all those cases are still pending, all those files have got piled up but none of them have got the justice.</p><p>\tThe beautiful journey of 26 years was just ruined in 26 minutes,</p><p>\tThe beautiful smile of the 26 year old angel was killed in 26 minutes,</p><p>\tThe beautiful soft skin of 26 year old PRIYANKA REDDY was just ruptured in 26 minutes.</p><p></p>","blog_headline":"Raise your voice","user_email":null,"user_insta":"https://instagram.com/sai_akash_27?igshid=sjlefsqpuku8","user_facebook":"https://www.facebook.com/sai.akash.334","user_linkedin":null,"user_name":"B Sai Akash","create_timestamp":"2020-08-23T10:35:29.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1mTvTqXDQWkmffIHnUk6dz_B-6W_QBg9o"}],"id":"64"},"__N_SSG":true}