{"pageProps":{"articleData":[{"pk_df_blog_page_id":67,"blog_content":"<p></p><p>\tIn the backdrop of the recent events, unfolding of the decriminalization of gay sex effectively amending section 377 of the Indian Penal Code 1860 “ a vestige of British colonialism, and  the victory and unprecedented support that followed for the LGBTQ community of India, let us shed some light on the achievements and what more we can collectively in India and South Asia as a whole.</p><p>\tIn South Asia, six countries have created the National Human Rights Institution (NHRIs), all of which include complaint mechanisms. In Bhutan, in which the NHRI has not been established yet, the government has created a human rights committee through its parliamentary system instead of a separate, independent body.</p><p>\tTheoretically, one would think the establishment of these NHRIs has provided LGBTQ people with access to complaints mechanisms that can help resolve human rights violations. In practice, several challenges remain to limit the use of this mechanism. This is South Asia after all, no mechanism functions the way it is supposed to without any impetus. And the public serving mechanism is just another means for earning the extra Chaye Pani Kharcha that seems like every other public servant cant live without.</p><p>\tLets get boring for a while, shall we?</p><p>\tThis is a table that shows the level of rights gained by our brothers and sisters belonging to the LGBTQ community living in South Asia.</p><p>\tSource:(Wikipedia-LGBT Rights in Asia)</p><p>\tSocial morality cannot be used to violate the fundamental rights of even a single individual; constitutional morality cannot be martyred at the altar of social morality.</p><p>\t“Chief Justice of India Dipak Misra</p><p>\tThe table is necessary as its an interactive and a more fun way to look at the data, aint it?</p><p>\tBut the real reason why the table was necessary is you dont even need to look at each sub-table to understand what is trying to be conveyed. Just looking at all the red crosses, one can see the dire need of proper human rights in South Asia, our region.</p><p>\tNot to be disrespectful or to take away anything from the sovereign parliament of each country, but one must learn from those who have achieved. And our region seems to have a lot to learn from one another and beyond.</p><p>\tIndia has achieved a landmark victory and all the other countries in the region and beyond can and must learn from her if they can. This was indeed a victory for them and I believe its an even bigger victory for us as a collective human species who could see beyond the differences and most importantly see the need of the hour and act accordingly.</p><p>\tTheres always a sense of competition in our neighbourhood on who gets to be more powerful and lobby bigger nations on their sides for various vested reasons. Decades have past and we cant move past that barrier, none of us has. Some people would say competitions among ourselves arent good, not only for the regional harmony but also for the people who live in it.</p><p>\tBut Id say competition is necessary. Id, in fact, go a feet more and say, Lets promote them! Why shouldnt we? They say there is no progress when one doesnt have any competitor. And Id tell them, Sir, Youre absolutely correct.</p><p>\tBut why would I say this? After all, all this has done is separate this regional landscape into blocks supporting one side or the other. One wouldnt be wrong to think in that way. But this region so needs competition, not an unhealthy one but one that brings positive changes to its people. You see healthy competition focuses on delivering a quality product and continuously looking for ways to improve it so that its better than the competitors. Unhealthy competition is negative and focuses on pointing out the flaws of its competitors and even tries to undermine it.</p><p>\tSo if we are to compete then let us compete on which country can deliver its citizens with a better life and a better treatment alike. Let us dwell on how we can help them(LGBT people) integrate into the society, get a fair treatment and even more a fairer chance at improving their lifestyles. That is the kind of competition this region craves.</p><p>\tHistory owes apology to the LGBT community. They were made to live a life full of fear.</p><p>\t“Chief Justice of India Dipak Misra</p><p>\tThe Indian judges at supreme court have this time written a great love story, one that sees the differences among human choices and sees them as natural, just like us, rather than fighting it with a mindset that would not be helping either side.</p><p>\tPeople around the world face violence and inequality”and sometimes torture, even execution”because of who they love, how they look, or who they are. We still have a lot to fight for.</p><p>\tTo its insurance, let this be just the dawn of a well written story, waiting to be written. Written by the people of this country and our region.</p><p></p>","blog_headline":"To be a Democracy","user_email":null,"user_insta":"https://instagram.com/g_amatya?igshid=1rknkpvrlotf5","user_facebook":"https://www.facebook.com/gaurab.amatya.3","user_linkedin":null,"user_name":"Gaurav Amatya","create_timestamp":"2020-08-23T10:35:30.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1UlX2QdE61ycapBmdpg2hCTKOBmFMQgdi"}],"id":"67"},"__N_SSG":true}