{"pageProps":{"articleData":[{"pk_df_blog_page_id":68,"blog_content":"<p></p><p>\tSharman was a 17 year old, and the only son of an affluent family. What can he have less of? A good school, tuitions, Abacus classes, guitar lessons, parents made sure there should be no compromises in grooming him for the competitive world. Afterall, the son of two huge corporate entities is destined to be huge himself!</p><p>\tHis gloomy face, dark circles and poor health had a different tale to tell. Sharman, being very close to his Daadi, had a dream.  He wanted to work for those, who knew failed to keep up, with this fast-moving society. He wanted to build an old age home for all the daadis and naanis who didnt get enough love.</p><p>\tOnce, twice, thrice, he tried to convince dad about sociology and his dream.</p><p>\tFutile.</p><p>\tScience wasnt his area of interest, nothing had helped him get anywhere. He wanted peace, he wanted to make decisions for his life, he wanted to be like Gopal</p><p>\tHis only closest to a friend was, Gopal.</p><p>\tGopals mother was in charge of Sharmans necessities, while, which was most of the times, his mom was away for work.</p><p>\tGopal, who now smoked cigarettes and occasionally chewed tobacco, has his ghosts to conquer. He hated to see his mom work all day, and then get beaten up by the drunk he never accepted as a father. He wanted fast money, he wanted to be like Sharman, the boy who had everything.</p><p>\tHis friends knew how all this should go away. The answer was magic powder, Coke.</p><p>\tHe knew who to sell it to.</p><p>\tThe one, who was constantly fighting demons, of his own, who was torn between peace and war, who was his friend. Sharman.</p><p>\t</p><p>\tTwo years later,</p><p>\tMr and Mrs Mehra are forced to take time out, to visit their son in a rehab.</p><p>\tAnd Gopals Mother doesnt work anymore, neither does he. After police found out drugs from their house, the jail has been their new home.</p><p>\tSociety plays a very vital role in the development of a teen.</p><p>\tTeenage is both fragile and volatile, a powerhouse of talent  No one knows who has brains as Einstein or who can craft words into emotions like Wordsworth.</p><p>\tIn this rapidly approaching advancement, they need to be attended slowly, maturely, patiently, because kids like Shraman and Gopal, arent born twisted, they were crafted into it.</p><p>\tListen to them, lend them your time, have the awkward talk.</p><p>\tIt might save their life and others. If not attended to, there will be only an increase in the number of Kamlesh, in India.</p><p></p>","blog_headline":"Two years, two lives, too much to understand, too less time","user_email":null,"user_insta":"https://instagram.com/annveshaa?igshid=1ewndxmijqavi","user_facebook":"https://www.facebook.com/acap1413","user_linkedin":"https://www.linkedin.com/in/anwesha-chakraborty-b90b6016b/","user_name":"Anwesha Chakraborty","create_timestamp":"2020-08-23T10:35:30.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1s964R-5q_hfVqpqvW2C4kzAwJNxq6VfF"}],"id":"68"},"__N_SSG":true}