{"pageProps":{"articleData":[{"pk_df_blog_page_id":8,"blog_content":"<p></p><p>\tDesire Foundation “ The first time I came across this word was in a notebook that I bought from a friend. On asking her more about the reason for selling the notebooks, I got to know what Desire Foundation actually does. This idea, as innovative as it was, appealed to me a lot. I felt an urge to be a part of it. And that's how my journey with Desire began.</p><p>\tDesire foundation is unique in its own way. It's not only helping the underprivileged to realize their rights but also grooming the youth for the upcoming professional environment that we all have to face.</p><p>\tThe interview was on a Saturday morning in February. I was nervous, but the way the interview panel interacted with me, made me really very comfortable. Everything went well and I became a part of the Desire Family.</p><p>\tThe first project I worked in was Khwaish-E-Shiksha. It involved collecting old textbooks.</p><p>\tThis project helped us distribute stationery items and Desire merchandise for free among children to help them understand the importance of education.</p><p>\tMy first slum visit was to Prasanti Vihar Slum. The idea of being able to go to a school brought happiness to the families there. There are so many kids out there who have not got the opportunity to go to a school and I could feel their plight and I am really thankful to Desire for helping me spread this happiness.</p><p>\tThe struggles are huge. Getting a child admitted to a school under RTE is a long procedure. But, the journey is awesome because of the people working here are a team and moreover a family.</p><p>\tBeing a part of the content team has given me a platform to express my views. Every article, every microtale, every caption is not just a task, they are our emotions and we want our voices to be heard across the country, so that more people can join us and can help Desire accomplish its dreams.</p><p>\tAdhyayan II is ON now. Targets are bigger. Our team is bigger. I will give my best to help as many children as possible, to get the chance of going to school.</p><p></p>","blog_headline":"Desire a journey to remember, memories to rejoice","user_email":null,"user_insta":"https://instagram.com/ananya_nag?igshid=11pmx9qbzrti2","user_facebook":"https://www.facebook.com/ananya.nag.789","user_linkedin":"https://www.linkedin.com/in/ananya-nag-785475150/","user_name":"Ananya Nag","create_timestamp":"2020-08-23T10:35:19.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1lQmqY42WuELdrRzpDfX1DEnAQEyHy66c"}],"id":"8"},"__N_SSG":true}