{"pageProps":{"articleData":[{"pk_df_blog_page_id":86,"blog_content":"<p>I, Tisha Mohan am a 5-year-old girl hailing from Bhubaneswar, Odisha. My Baba Brijesh Mohan, works at the sugar cane factory and my Maa Smita, works as a help for a few well-to-do families. My parents have always been keen about arranging the best form of education for me and help me grow up to be a learned and civilized being who would serve the nation. They also saved up money to send me to school but obviously affording the best ''private'' ones was not possible. Until, one day Baba came running home on a not-so-usual time along with a didi. Maa and Baba both looked so joyful after talking to her although I didn't understand a word of what was going on but just then didi leaped forward, flunged her arms, took me up and said \"Get ready kid you will be going to school from tomorrow!\". Baba and Maa told me that the didi was from Desire Foundation, an organisation that helps needy and aspiring kids like me to enroll into the best schools (the ones that didn't seem affordable for us before). Didi also helped us with the entire enrolment process. Truly, studying in a big school like this was a dream come true. My teachers and friends were so loving and warm.</p>\n<p>All was merry till - a disease called Corona took over the world. Honestly, when they called off school beginning, I was thrilled to stay back at home, though Maa and Baba didn't seem happy about the news. But after a while, the thrill of staying at home started to wear off. The going got tougher and tougher. After dinners when I went to bed, I could listen to my parents whispering to each about the shortage of money. Baba was temporarily unemployed and so was Maa. They feared I would have to stop going to school completely and this came like a blow to my head, hard to process and even harder to forget the incredibly happy moments I had back in school.</p>\n<p>To our relief one day Baba showed up with the same happiness on his face again but this time with better news. The same didi had called Baba and provided him with a weird offer where Baba's gizmo kind of thing which he used for calling could help me learn from my teachers virtually and she also guided Baba on the whole process. Onthe first day of my “virtual” class I was surprised to learn that that not only were the teachers great at teaching but they actually let me watch my favorite cartoons sometimes too. The teachers taught me that A is for apple, B is for a ball, C is for ''chinchan'' and D is for ''Doraemon''. I mean how cool is that right? Baba says that we didn't even have to pay a rupee for all this. They are so kind. Eventually I got to know from Baba that something called Adore India is helping me learn in this crisis. Yes, I do miss school, benches and friends with whom I used to play and my loving teachers but nowadays, virtual learning makes me so happy and I feel there’s no longer a dull moment. I even started painting and the teacher taught me how to draw a tree, apple, rabbit, elephant and so many more. I surprised my teacher by drawing my favorite cartoon character “Doraemon”!</p>\n<p>The teacher taught us “SAVE THE TREE, SAVE THE WORLD\" – meaning if we save more trees than cut, we can save our world from dangerous diseases like Corona. I'm very happy that my learning hasn't stopped and that my parents do not have to pay for my learning during this rrisis... THANK YOU DESIRE FOUNDATION AND ADORE INDIA!</p>","blog_headline":"Adore India & Desire Foundation – our knights in shining armor!","user_email":"reshmidutta100@gmail.com","user_insta":null,"user_facebook":"https://www.facebook.com/profile.php?id=100009215624719","user_linkedin":null,"user_name":"Reshmi Dutta","create_timestamp":"2020-11-11T05:02:04.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1i_aZFVApPG57-LCAbSqAZct-y5AU3-O6"}],"id":"86"},"__N_SSG":true}