{"pageProps":{"articleData":[{"pk_df_blog_page_id":87,"blog_content":"<p>“Harshit! Get up, it's already nine, you'll miss your recruitment”. Least was I aware, that morning will bring a whole new perception of how life unfurls its arms. It was a February morning, the first year lad had left for the venue in shaggy formals for his first-ever interview. After a series of questions and tasks, my anxiety starting turning into excitement. Being asked about my hobby, I was given a task of singing in front of everyone. Also, I still remember how Sejal Di had blown up on me when I was trying to sell her the notebook to which she apologized later and revealed that everything was a part of the recruitment process.</p>\n<p>The results came, I got selected, added into different what's app groups, getting varied tasks leaving me completely astonished about what exactly a proper work-culture is and yes it's of course different from our daily monotonous lives. My first GBM had Sweksha Di, looking quite similar to one of my cousins, left me in awe about her strong oratory skills. Soon, I got adapted to the atmosphere here, started accomplishing tasks given by Ghosh Bhaiya and Stuti Di, got into stronger relations with people from different backgrounds, states and languages which taught me how different people have different views towards life aspects.</p>\n<p>Came the day, I had been eagerly waiting for. Actually, before coming to college, I had seen a few pictures of college students going on a visit to the slum. I always had this curiosity about what they do, do they give them money or buy them food, which got cleared after getting into Desire and was also my motive of getting into the same. Stuti Di accompanied me, through my first Adhyayan visit. It was a heavy, sweaty and tough day with a sprinkle of satisfaction, happiness and pride. I was tired, definitely, but determined as I was sure my tiredness was for someone's good.</p>\n<p>Desire has always set up examples and made us understand life drills. “No work is small, it's only our mind which makes us think so”. I was trying to find ways to sell the notebooks where I landed with a puzzling decision of going room to room and sell them. To be frank, I was reluctant and shy about what will my friends and hostel mates say if they see me selling notebooks, a salesman. Holding all my nerves, I got to them, explained them what we do and for whom the contribution is. Not only they bought the copies, but also they appreciated the noble cause. Yes, of course, few were still laughing but till then, the smile of children in slums started seeming much more important than those laughs.</p>\n<p>Adhyayan, the life-giving, acts as a source of all energy and spirit in Desire. It was the last phase of Adhyayan and the lists for KV were already out. A guardian, who was an Auto Rickshaw Driver wasn't able to get his son admitted on the first out of three days and hence was tensed. We were unable to find mutual free time as I had my practical exams in the morning and he had to work for his daily wages in the evening. Finally, we decided to meet at 4 o'clock in the morning. That morning brought a lesson about why we should respect what we have in our lives. The parents had come with all documents ready and their child properly dressed. It took an hour to get everything done. All that time, that small kid kept on running here and there. At the time of bidding bye, the mother gave me a Frooti, they asked their child to touch my feet and the father showed his gratitude by hugging me where I felt his emotions in his overwhelming eyes.</p>\n<p>This was the time where I realised how blessed we are to get enough to have three-time meals a day, to have ample opportunities to study in whichever school or college we want, to have a choice of getting any dress on festivals. That day, those so-called small people from the slums taught a privileged boy how “The life we live is a dream to many”. </p>\n<p>Desire transforms lives, not only of the people in the slums but of everyone attached to it.</p>","blog_headline":"Desire: Our Aspiration, their Glee …..","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/harshit.anand.50","user_linkedin":null,"user_name":"Harshit Anand","create_timestamp":"2020-11-15T05:48:18.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1_-EUjYia4bnwKJ4AI7skjxY6msH50OJr"}],"id":"87"},"__N_SSG":true}