{"pageProps":{"articleData":[{"pk_df_blog_page_id":9,"blog_content":"<p></p><p>\tI applied at Desire Foundation for a position in HR department but ended up being selected in Sales department. I was absolutely clueless about what Desire Foundation is when I first got interviewed for it but as time flew by and I started working, I got to know that I did not become a part of a professional organization rather a family. When I joined Desire I was a part of Adhyayan III. Yes, we faced a lot of pressure but it was all worth it when I saw the dreams of underprivileged families getting fulfilled because of our efforts. Their happiness was truly something, I could cherish. Though I was a sales intern, my efforts were more inclined towards Project Adhyayan.</p><p>\tDesire has not only been a reason for my inner happiness but has also helped me grow as an individual and a responsible citizen. A girl who had stage fright due to a shaky confidence is now confident enough to approach people and interact just because of the opportunities and welcoming environment that Desire provides. It nurtures every member as it's own. The thing that I love the most about Desire is that it is professional and at the same time it's fun. One would never feel dreary while working here.</p><p>\tThe path from being a Sales Intern to Adhyayan Coordinator has had it's own twists and turns. The struggle of running down from schools to slums in the scorching heat of Bhubaneshwar, to get a child admitted, to managing a whole team under Adhyayan IV is not easy but it's rewarding for every obstacle I faced. This entire journey couldn't have been possible without the guidance of my seniors, support of my peers and adorable juniors. No matter how I lead my life, wherever I am, I'll always be a part of this family and I'm proud of how it has transformed me for better. Desire taught me to be grateful for everything I have which someone wishes to have and that changed my outlook on life.</p><p></p>","blog_headline":"Desire transformed me","user_email":null,"user_insta":"https://instagram.com/smritishekharr?igshid=3ejmay7qbmkl","user_facebook":"https://www.facebook.com/smriti.shekhar.10","user_linkedin":"https://www.linkedin.com/in/smriti-shekhar-6055ba1a7/","user_name":"Smriti Shekhar","create_timestamp":"2020-08-23T10:35:19.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1UmtQgANGTb4U25YmbtMJH29Raa3IJPjE"}],"id":"9"},"__N_SSG":true}