{"pageProps":{"articleData":[{"pk_df_blog_page_id":90,"blog_content":"<p>LGBTTQQIAAP (lesbian, gay, bisexual, transgender, transsexual, queer, questioning, intersex, asexual, ally, pansexual) or LGBTQ+ community is an association of members coming from varied background of orientation. To discuss the plight of the rainbow people in India today, it is important to know the meaning of certain phrases and words:</p>\r\n<p>Lesbian: A lesbian is a female homosexual: a female who experiences romantic love or sexual attraction to other females. </p>\r\n<p>Gay: Gay is a term that primarily refers to a homosexual person or the trait of being homosexual. Gay is often used to describe homosexual males but lesbians may also be referred to as gay.</p>\r\n<p>Bisexual: Bisexuality is romantic attraction, sexual attraction or sexual behavior toward both males and females, or romantic or sexual attraction to people of any sex or gender identity; this latter aspect is sometimes termed pansexuality.</p>\r\n<p>Transgender: Transgender is an umbrella term for people whose gender identity differs from what is typically associated with the sex they were assigned at birth. It is sometimes abbreviated to trans.</p>\r\n<p>Transsexual: experience a gender identity inconsistent or not culturally associated with the sex they were assigned at birth.</p>\r\n<p>Queer: Queer is an umbrella term for sexual and gender minorities that are not heterosexual or cisgender. </p>\r\n<p>Questioning: The questioning of one’s gender, sexual identity, sexual orientation, or all three is a process of exploration by people who may be unsure, still exploring, and concerned about applying a social label to themselves for various reasons.</p>\r\n<p>Intersex: Intersex is a variation in sex characteristics including chromosomes, gonads, or genitals that do not allow an individual to be distinctly identified as male or female.</p>\r\n<p>Asexual: Asexuality (or nonsexuality) is the lack of sexual attraction to anyone, or low or absent interest in sexual activity.</p>\r\n<p>Ally: An Ally is a person who considers themselves a friend to the LGBTQ+ community.</p>\r\n<p>Pansexual: Pansexuality, or omnisexuality, is sexual attraction, romantic love, or emotional attraction toward people of any sex or gender identity. Pansexual people may refer to themselves as gender-blind, asserting that gender and sex are insignificant or irrelevant in determining whether they will be sexually attracted to others.</p>\r\n<p>Agender: Agender people, also called genderless, genderfree, non-gendered, or ungendered people are those who identify as having no gender or being without any gender identity. This category includes a very broad range of identities which do not conform to traditional gender norms.</p>\r\n<p>Gender Queer: Gender Queer is an umbrella term for gender identities that are not exclusively masculine or feminine—identities which are thus outside of the gender binary and cisnormativity.</p>\r\n<p>Bigender: Bigender is a gender identity where the person moves between feminine and masculine gender identities and behaviours, possibly depending on context.</p>\r\n<p>Gender Variant: Gender variance, or gender nonconformity, is behaviour or gender expression by an individual that does not match masculine and feminine gender norms. </p>\r\n<p>Pangender: Pangender people are those who feel they identify as all genders. </p>\r\n<p>In discussing the history of the movements relating this community, it is important to realize that emergence of the rainbow family is not a recent occurrence. Homosexuality in India has been a subject of discussion from ancient times to modern times. Hindu texts have taken positions regarding the homosexual characters and themes. Rigveda, one of the four canonical sacred texts of Hinduism says Vikriti Evam Prakriti (meaning what seems unnatural is also natural), which some scholars believe recognises homosexual dimensions of human life, like all forms of universal diversities. The Arthashastra, an ancient Indian treatise on statecraft, mentions a wide variety of sexual practices which, whether performed with a man or a woman, were sought to be punished with the lowest grade of fine. While homosexual intercourse was not sanctioned, it was treated as a very minor offence, and several kinds of heterosexual intercourse were punished more severely.</p>\r\n<p>Section 377 of the Indian Penal Code is a section of the Indian Penal Code introduced in 1861 during the British rule of India. Modelled on the Buggery Act of 1533, it makes sexual activities \"against the order of nature\" illegal. In 2009, adult consensual homosexual relations were decriminalised in the Indian Penal Code. This ruling by the Delhi High Court was seen as a landmark in the Indian gay rights movement. In December 2013, however, the reintroduction of Section 377 of the Indian penal code re-criminalised homosexuality. </p>\r\n<p>On 6 September 2018, the Supreme Court of India ruled that the application of Section 377 to consensual homosexual sex between adults was unconstitutional, \"irrational, indefensible and manifestly arbitrary\". The Court also called for equality and condemned discrimination, stated that the protection of sexual orientation lies at the core of the fundamental rights and that the rights of the LGBT population are real and founded on constitutional doctrine. This judgment was believed to imply the unconstitutionality of section 377. </p>\r\n<p>Despite the judgment given by the Supreme Court, the condition of the people of this community has still not bettered over time. \r\nPeople around the country still tend to have an innate homophobia in them. Members of the community still refrain from coming out to their parents for the fear of being treated as a patient. Homosexuality, to most Indian parents, still remains to be a disease that needs to be treated. The social stigma attached to it isolates individuals and in some cases forces them to depression, mental and physical health breakdown and even death.</p>\r\n<p>But the problem does not lie with the older generation only. Over the years, several youngsters have used the term ‘gay’ as an insult/slang. Mistreatment of trans people is also common even today.</p>\r\n<p>It is important for everyone to realize that being a part of the community is not a ‘problem’, nor is it a ‘choice’. LGBTQ+ individuals are merely individuals who have sexual preferences that differ from what would appear to be the ‘norm’. The society needs to stop assigning gender roles with colour, clothes, job or way of life. </p>\r\n<p>Our 'nation', or for that matter most oriental countries that have had a prolonged history of Christian colonization, follows a complex social pattern that gravitates towards ambiguous and superficial elitist ethos, derived mainly from the colonizer's whip. We're well aware that Sodomy is a sinister slang in the British tongue, synonymous with homosexuality or sexual activities not practised in a civil society. It took years to normalise homosexuality in the Western 1st world countries.</p>\r\n<p>Under the current political scenario of India, it still appears to be quite impossible to hope that the LGBTQ+ community will find widespread acceptance. It is true that a considerable portion of the Indian youth has been more accepting about their sexuality and gender preferences, recently, but that's mostly due to the influence of popular media and arts. </p>\r\n<p>So, what is the importance of the LGBTQ+ community in the development of our nation?\r\nThe importance is for the citizens to be more accepting, more humane and more supporting of others' choices. One should question one's paternal values and psyches. The previous generations should try to interfere less in the sexual preferences of the young. Love and sex is like coffee and cigarettes. In the end, those two amount to nothing in the morale development of an individual, (keeping in mind how complex the post-modern mind is after all) There's nothing 'queer' about this Queer.</p>","blog_headline":"LGBTQ + Community in India","user_email":"ups0408@gmail.com","user_insta":"https://instagram.com/upasana_ghosh?igshid=hld19oug325w","user_facebook":null,"user_linkedin":null,"user_name":"Upasana Ghosh","create_timestamp":"2020-11-26T06:20:20.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1XBGUd_gC18jj99Kwbj-H2Let9nz_4r2i"}],"id":"90"},"__N_SSG":true}