{"pageProps":{"articleData":[{"pk_df_blog_page_id":92,"blog_content":"<p><strong>What is World AIDS Day?</strong></p>\r\n<p>World AIDS Day takes place on 1 December each year. It’s an opportunity for people worldwide to unite in the fight against HIV, to show support for people living with HIV, and to commemorate those who have died from an AIDS-related illness. Founded in 1988, World AIDS Day was the first-ever global health day.</p>\r\n<p><strong>Why is World AIDS Day important?</strong></p>\r\n<p>Over 103,800 people are living with HIV in the UK. Globally, there are an estimated 38 million people who have the virus. Despite the virus only being identified in 1984, more than 35 million people have died of HIV or AIDS, making it one of the most destructive pandemics in history.</p>\r\n<p>Today, scientific advances have been made in HIV treatment, there are laws to protect people living with HIV and we understand so much more about the condition. Despite this, each year in the UK over 4,450 people are diagnosed with HIV, people do not know the facts about how to protect themselves and others, and stigma and discrimination remain a reality for many people living with the condition.</p>\r\n<p>World AIDS Day is important because it reminds the public and government that HIV has not gone away – there is still a vital need to raise money, increase awareness, fight prejudice and improve education.</p>\r\n<p><strong>What can I do on World AIDS Day?</strong></p>\r\n<p>World AIDS Day is an opportunity to show solidarity with the millions of people living with HIV worldwide. Most people do this by wearing an HIV awareness red ribbon on the day.\r\nGetting tested is the only way to find out if you have HIV. If you are living with HIV, starting treatment early means you can live a full, healthy and productive life. Free and confidential HIV tests are available from NHS sexual health clinics (also called GUM clinics), charity testing services, many GP surgeries, pharmacies or online for self-testing at home.</p>\r\n<p><strong>But what about after World AIDS Day?</strong></p>\r\n<p>World AIDS Day maybe once a year, but you can still support people living with HIV all year round. Sign up to National AIDS Trust’s mailing list to stay up-to-date with new developments in HIV, and learn how you can get involved as an activist or as a volunteer.</p>\r\n<p>You can also support our work by donating to the National AIDS Trust. We rely on your support to continue championing the rights of people living with HIV.</p>\r\n<strong>\"Dare to reach out your hand into the darkness, to pull another hand into the light.\"</strong>","blog_headline":"WORLD AIDS DAY","user_email":null,"user_insta":"https://instagram.com/sai_akash_27?igshid=sjlefsqpuku8","user_facebook":"https://www.facebook.com/sai.akash.334","user_linkedin":null,"user_name":"B Sai Akash","create_timestamp":"2020-12-01T06:11:41.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1hNfJP9hcho3krhRuikZTbct76h8Mh788"}],"id":"92"},"__N_SSG":true}