{"pageProps":{"articleData":[{"pk_df_blog_page_id":99,"blog_content":"<p>It was the first week of August 2019. The monsoon had just arrived. </p>\n<p>“ As I woke up to the drizzle,<br>\nA soothing breeze eased overnight puzzle.<br>\nClouds cleared up for the Sun in zest,<br>\nSchool Lads gazed sky for rainbow in the West.”<br></p>\n<p>I had to attend an interview for the recruitment in Desire Foundation at 9 AM. I was interviewed by our former Content Coordinator “Asmita Mukherjee”. The cool breeze helped my anxiety level to numb my feet and my fingers. The interview lasted for 50 minutes and I was pretty satisfied with my performance. My desire of working in Desire came true, when I got selected as a content writer in Desire Foundation. </p>\n<p>It has been one and a half years in Desire and it certainly has been a roller coaster ride. The sense of satisfaction that we experience after filling up an admission form is incomparable to any wild pleasures of our daily life. It is quite tough to pen down all my memories from Desire; so, I would like to express my emotions through a poem;</p>\n<p>My eyes opened up blissfully to the sun<br>\nMy soul, heart, and brain emerged as one<br>\nBehold my journey in Desire had begun! <br></p>\n<p>It has been a mystifying journey<br>\nWith every up and down<br>\nWith tears and laughter<br>\nWith blessings and love<br>\nWith stupidity and wisdom<br>\nWith seniors and friends;<br>\nIn this memorable journey with Desire,<br>\nI have found a means of celebration<br>\nIn my toilsome exploration to my fateful destination.<br></p>\n<p>This journey is an adventure,<br>\nIt is a mental journey through nature<br>\nWith the care & support of my family and friends,<br>\nI believe I can complete it with love in my hands.<br></p>\n<br>\n<p>“THANK YOU DESIRE FOUNDATION FOR ALL THE MEMORIES.”</p>","blog_headline":"Audacious Flight","user_email":null,"user_insta":"https://instagram.com/sai_akash_27?igshid=sjlefsqpuku8","user_facebook":"https://www.facebook.com/sai.akash.334","user_linkedin":null,"user_name":"B Sai Akash","create_timestamp":"2020-12-20T05:22:10.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1eXU8N1VWeRV4Qgm3jn5Gpy0FCpWcjbWG"}],"id":"99"},"__N_SSG":true}