{"pageProps":{"articleData":[{"pk_df_blog_page_id":101,"blog_content":"<p>\"DESIRE, a strong feeling to make anything happen!\"\nNo matter who you are, you can always do GOOD, and can always stand out with your weird and amazing ideas.</p>\n\n<p>It was even before my college life when I saw Desire Notebooks. It had Harry Potter and F.R.I.E.N.D.S doodle on it’s covers, and obviously, being a school kid, it pretty much amazed me and I ended up asking for more. </p>\n\n<p>When I got into KIIT, Desire had been on my wish-list, and luckily I got an opportunity to be a part of it. </p>\n\n<p>It was back in August 2019 when I applied for an internship at Desire Foundation. I gave the interview and I gotta admit that I was extremely anxious, but Siddhartha and Parth bhaiya tried their best to ask questions in a very friendly manner and it made me realize that if I got selected then I'm gonna meet great seniors here. After some days, I got a mail regarding my selection as a Sales Intern and I cannot express the feeling of happiness that I went through. Also, all the procedures and work culture here had already given me a vibe of professionalism. From my first GBM till this day, I see one thing that hasn't changed, and that is, I always get to learn and feel inspired by many of my seniors and juniors. It’s always been fun working here. Talking to the parents of the children for the first time was a bit difficult for me because I was neither a confident nor a talk-loving person, but it changed with the first call I made, the way in which the parents responded, made me feel that I am doing something very beautiful, telling them about RTE and helping those brilliant kids getting admitted in good private schools. Adhyayan is something which will always remind me that happiness can be found in others’ smile, that happiness can be found in helping. Being a part of Desire will always make me proud.</p>\n<p>The part where I was a Sales Intern, I heard that people felt embarrassed about selling Notebooks but I never felt that way. I had always adored selling copies, making conversation with strangers professionally, managing sheets, collecting money, and taking updates. I remember, I used to walk in the whole corridor holding a stack of copies, selling them all, and running back to my room for taking more copies and selling it all over again. knocking on every single door and telling them all about our motive behind the copy selling made me an expert in convincing strangers. Initially, I wasn't aware that it would be easy to convince anyone, but as it went I kind of started enjoying it. I explained to them all about our work and they didn't only look interested in buying copies, but they eventually wanted to know more about our work and as a result, I was able to sell a good number of copies. Later, girls from my hostel started coming to my room for buying copies, and this way many people in my hostel started knowing me.</p>\n\n<p>\"The challenge of leadership is to be strong, but not rude; <br>\nbe kind, but not weak; <br>\nbe bold, but not bully; <br>\nbe thoughtful, but not lazy;<br> \nbe humble, but not timid; <br>\nbe proud, but not arrogant; <br>\nhave humor but without folly.\"<br></p>\n<p>Seeing all my senior ex-coordinators standing and addressing team had inspired me a lot and made me want to do it, and experience it. In order to make my dream come true, I filled the form for the selection of coordinator. I had no expectations of being chosen but fortunately, when results came, I saw my name mentioned along with all other new coordinators. I was utterly overwhelmed when I got to know that I actually became the Merchandise coordinator. </p>\n\n<p>Now, with any position, comes responsibilities and I knew that the journey of being a coordinator is not going to be easy, but I wanted to win this challenge. In this journey of 8 months, I eventually accumulated palpable skills such as convincing, communication, leadership, time management, and a lot more. \"Situations we fear must be faced in order to overcome it.\" This is something I learned during this beautiful journey and it is always going to stick with me. </p>","blog_headline":"My Journey Of Prakriti","user_email":"prakriti006@gmail.com","user_insta":"https://www.instagram.com/wabisabime_/","user_facebook":"https://www.facebook.com/profile.php?id=100004697448944","user_linkedin":null,"user_name":"Prakriti Arya","create_timestamp":"2021-01-02T03:25:35.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=10n85PPW_TPox_gTTVLUY8ninShjMmP1J"}],"id":"101"},"__N_SSG":true}