{"pageProps":{"articleData":[{"pk_df_blog_page_id":106,"blog_content":"<p>It all started with REJECTION. Yes, rejection. By profession, I am a video editor- worked with multiple clients under multiple projects. During my 2nd year, in the starting phase, there was a craze of joining cultural societies. I was too much excited to experience a new thing and in that excitement, I applied for 2 societies but my form was rejected from both.</p>\n<p>One fine day, a mail popped stating “Social Internship Opportunity” and it was from Desire. I searched for the organization in Instagram and it’s social works excited me to apply. Luckily, my form was selected and got a call from the HR team for the interview. I was very much nervous for it but the interviewers’ took it to that level of comfort that it turned out as a conversation between two people. Here my journey starts as a member of Desire.</p>\n<p>Now it has been almost 1 and a half year here, I can proudly say, I have got a family. Desire has not only given me the opportunity to work but also given the opportunity to learn new things. I joined here as a video editor but now I have multiple skills in the field of designing. The best decision I took was to join the Desire Foundation. The slum visits every weekend fascinated me. I enjoyed meeting new people, interacting with children and helping them get their rights to education.</p>\n<p>The day, I still remember that left a lasting impact on me was a child’s admission into a reputed private school in Bhubaneswar. Since we have access to different facilities like the internet, etc, we never realize the struggle of getting an admission form for any reputed school/ university. But that day, I was on the field with 3 other team members, for the admission of that child, I realized, it’s far more difficult for BPL children and their parents to get the same. We struggled for 6 hours in the scorching heat of March to get a simple admission form. The parents were not educated enough to deal with the school officials who tried relentlessly to deny us the form. After a long struggle of multiple verifications, we finally got the form. The happiness I saw in the parents’ eyes is still fresh in my memory. The form didn’t guarantee the child’s admission to the school but it felt like a victory and one step forward to his brighter future.</p>\n<p>That day I realized, we often take the resources we have for granted. When my parents share the story of my admission, I never hear the word struggle in it but it’s completely opposite for these underprivileged children. We are often oblivious to this other half of the world where people struggle to get one meal a day. This incident made me more considerate, humble and I have a new-found respect for every opportunity in life.</p>","blog_headline":"Rejection To Responsibility","user_email":"eepakranjanmuni99@gmail.com","user_insta":"https://instagram.com/dipppak99?igshid=ewgqn6683pus","user_facebook":null,"user_linkedin":null,"user_name":"Deepak Ranjan Muni","create_timestamp":"2021-01-28T05:39:49.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=18BUUqP6HTVbxSqySoOj3afCe4OKd6Ldp"}],"id":"106"},"__N_SSG":true}