{"pageProps":{"articleData":[{"pk_df_blog_page_id":107,"blog_content":"<p><span style=\"font-size: 14pt;\">Let me take you on a journey where we relive some beautiful memories from my life at Desire. It all began with my desire to do something different in my college. During my first year at college I got to know about Desire Foundation and their contribution towards the welfare of the underprivileged children. This fascinated me and I decided to apply for an internship position at Desire.</span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">I still recall my interview which lasted over an hour, where I was interviewed by Siddhartha Bhaiya. He is one of the coolest seniors I ever met.</span></p>\n<p><span style=\"font-size: 14pt;\">The work culture and the motivation I received from my seniors always fascinated me right from the first GBM itself. The most interesting part of working at desire is the project Adhyayan where I got to visit various slums with my team members. There we got to interact with various parents about the RTE Act and how important it is for their children to receive quality education. These interactions grew a strong bond between us. My confidence in speaking to people significantly increased as a result of these interactions.</span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">We worked very hard and with full determination as we knew the future of a child depends on our work. We visited various schools within close radius of the slum. Time flew and the day of admissions under the RTE came. I still recall my visit to Khandagiri School where we braved the scorching heat of summer and after long conversations and multiple trips we finally achieved confirmed admissions of some children in the school.</span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">One of the children couldn’t get admission due to certain issues. Her mother came to me and said that her child is intelligent and wants to learn asked if something could be done for her child. We visited another school and tried to get admission for the child. The bright faces of the children lit up with joy brings immense satisfaction to me. The thought that my work helped a child get quality education further motivates me in my journey.</span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">From all this I want to recite the lines of Mahatma Gandhi, “You must be the change you want to see in the world.”</span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">My work as a sales intern is to generate funds by selling our merchandise, managing the sales sheet, taking updates and also motivating others to do sales. Since this was my first experience in this field I am thankful to my seniors and ex-coordinators for their timely help and guidance. </span>&nbsp;</p>\n<p><span style=\"font-size: 14pt;font-family: Calibri, sans-serif;\">I did all the tasks assigned to me with complete determination and my hard work finally paid off and I was selected as a Coordinator which was totally unexpected. My new role as a Coordinator demands more devotion, ideas and the skills to manage the team for the growth of the organization and I am delivering all these and learning everyday under the guidance of my seniors. At last I would say that this organization has now become a family to me. Our bond only grows stronger everyday and I can never forget this family away from home.</span>&nbsp;</p>\n","blog_headline":"A Journey Worth Remembering","user_email":"ujjwalkumarprem@gmail.com","user_insta":"","user_facebook":"https://www.facebook.com/ujjwalkumar786","user_linkedin":"https://www.linkedin.com/in/ujjwal-kumar-27412117b/","user_name":"Ujjwal Kumar","create_timestamp":"2021-02-06T06:19:24.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1zw0tqTjFWiSAB1YKr_sDKtLgIDYK9Wgs"}],"id":"107"},"__N_SSG":true}