{"pageProps":{"articleData":[{"pk_df_blog_page_id":110,"blog_content":"<p><strong><em>\"Some stories are meant to be shared, </em></strong></p>\n<p><strong><em>While some stay in shades of unpredictability hidden. </em></strong></p>\n<p><strong><em>Some instances are meant to be aired, </em></strong></p>\n<p><strong><em>While some memories hold on and their feelings stay within. \"</em></strong></p>\n<p></p>\n<p>I started on a note of passion exploration this long run,&nbsp;</p>\n<p>Never thought it could have been so much fun.&nbsp;</p>\n<p>From knowing unknowns and new faces as I joined onboard,&nbsp;</p>\n<p>To making friends and memories I recall when I'm bored.&nbsp;</p>\n<p>The passion for writing fueled the process of joining here,&nbsp;</p>\n<p>Not just an organisation but, Desire Foundation provided me the much needed spotlight here.&nbsp;</p>\n<p>And soon did I realize that this passion could help someone overcome their fear.&nbsp;</p>\n<p>Fears of seclusion, racism, stereotypical thinking that chains their  minds from shining bright.&nbsp;</p>\n<p>That moment I thought why not be a much needed help in their fight.&nbsp;</p>\n<p>Through out the journey I too witnessed some ups and some instances that shook me down,</p>\n<p>Just to learn from those experiences, carve out a better myself and add them as feathers on my crown.&nbsp;</p>\n<p>Writing captions, blogs and stories were a task I was use to even before ,</p>\n<p>But now I had a reason to help somebody fly high in the sky and soar.&nbsp;</p>\n<p>The feeling of helping and catering to minds that were capable yet pushed back,&nbsp;</p>\n<p>Made me  emotionally understanding and helped me add up experiences on my stack.&nbsp;</p>\n<p>Today as I see back and wonder what I really worked on and achieved after all,&nbsp;</p>\n<p>I realize it's just a bunch of happy faces with an enlightened future that makes me proud of my contribution after all.</p>\n","blog_headline":"AN EXUBERANT TALE","user_email":"ronny142000@gmail.com","user_insta":"https://www.instagram.com/debangshu_14?r=nametag","user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/debangshu-chakraborty-124659191","user_name":"Debangshu Chakraborty","create_timestamp":"2021-02-20T07:56:44.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=193DbLhxqUGW0wSeH1FjRnbTrETeto0Jc"}],"id":"110"},"__N_SSG":true}