{"pageProps":{"articleData":[{"pk_df_blog_page_id":128,"blog_content":"<p>Dusk has fallen. The tints of the sky waved at me with a luring mysterious smile. These days are turning more obscure filled with frightless fights, strange silence and alarming agonies.<br>Here I am, wretched and unaware of what awaits for me! Panting through the fiery time of the day when the fireball is a real savage, I could feel those alarm bells from the past. Last twenty years have witnessed quicker changes through flood, drought, extreme snowfall, cold waves, heatwaves being broken by thunderstorms and more of the same. Today, sun scorching days suddenly turn dark and the sullied nights boom with sandstorms. And here I stand old and feeble with no colours symbolic of the end of a timeline. There are no chirps and no more colours! But there is this smell of death in the air, water and soil. The bitter realisation, of my home being turned into a deserted place without leaving behind pieces from the good old memories, was agonizing. But now I cool my heels for the day when my hueless arms get deprived of blood and stain. Pointing at me, once he told his son, “Don’t hold feelings for it, Beta.. It’s just a tree!” The kid was hugging me to save me from the teeth of the axe blade. He adored me for the delish fruits and I loved him back too. He gave me hope amidst the loop of paradoxes; it was only to make me aware of how perpetuated dilemmas cause greater threats. I regained my breath from the axe blade at the cost of lives sheathing me.</p>\n<p>It all started with my white blooms which turned into ruthless, smoky grey. Trailing through my way beneath the soil in quest of ‘drops of life’, I could sense the nearest dark future. Life without life is the worst misery one can ever go through. Your psyche leaves a blank space once you regret for the things you took for granted!</p>\n<p>Now that darkness laid out, the silver crescent just arose in the sky. I can see miracles sprouting up in the sky. Though I am not privy to their untold stories, let me prize this gentle breeze before any abrupt switch to the wild.</p>\n<p>But where does this fluttering sound come from?! Oh, it’s a bird.. A lovely little bird!! It’s slowing down to take rest on my arms. But how did it reach here?!</p>\n<p>Up in the sky, the miracles twinkled and the bird began to sing out loud in its melancholic voice –</p>\n<p style=\"text-align:center;\"><strong>“Behold! when the Sun peeks out<br>And throw light to break the shadow.<br>He'll see the vanishing meadow,</strong></p>\n<p style=\"text-align:center;\"><strong>Wrinkled land and steaming air.<br>Behold! He's your own heir!</strong></p>\n<p style=\"text-align:center;\"><strong>With sweat and shiver He stands<br>With fear and ill He stays!<br>Yes! He’s the future,He’s you!<br>The suffering, shivering you,</strong></p>\n<p style=\"text-align:center;\"><strong>Walking miles to cool His throat<br>The sickly master of the Earth!<br>Wait not for miracles’ drive<br>For you to heed and thrive!</strong></p>\n<p style=\"text-align:center;\"><strong>Don’t hold back an Eighty years<br>Or watch your future crawl! “</strong></p>\n<p></p>\n<img src=\"https://drive.google.com/uc?export=view&id=19rLL4STYNmMy90L23-yQ94qJZbdH2klS\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n","blog_headline":"A Letter from the Year 2100","user_email":"athulya19@iiserb.ac.in","user_insta":"https://www.instagram.com/athull_lya/","user_facebook":"","user_linkedin":"","user_name":"Athulya T Gopi","create_timestamp":"2021-04-22T00:04:43.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1oZx0f0euJBVVvYt47B54dmWdM8qUTe1f"}],"id":"128"},"__N_SSG":true}