{"pageProps":{"articleData":[{"pk_df_blog_page_id":13,"blog_content":"<p></p><p>\tI always had a passion for helping people. Desire made it possible to take that to the next level. When I started out at Desire, it was the first time I was surrounded by people who were more concerned about how they could help others instead of what they could do for themselves. It has been an amazing experience, being a part of something bigger than myself and joining hands to change someone's life for the better. I have learnt so much in these past two years from the people I've worked with, more than I can ever hope to impart to them. The joy you experience when someone can finally pursue their education and you are, albeit in a seemingly insignificant way, responsible for it is unparalleled. From slum visits to final admissions in schools, this journey (although challenging at times) has been incredibly fulfilling.</p><p>\tEveryone at Desire is a part of the family; you never feel like an outsider. This is something everyone puts a lot of emphasis on; which is why we all share a very special bond here. The seniors have always been forthcoming with their advice, guiding us through the ways of our foundation with their experience.</p><p>\tDesire has given me an identity, helped me become a better version of myself and has also made me realize the impact a little time and effort from us can have on someone's life. It has helped me grow, appreciate and see things in a very different light than I used to, given me a better understanding of my country, and for that I'll forever be grateful to Desire.</p><p></p>","blog_headline":"High on hope","user_email":null,"user_insta":"https://instagram.com/anushabhowmick?igshid=1nw7xqysw9l2i","user_facebook":"https://www.facebook.com/anusha.bhowmick","user_linkedin":null,"user_name":"Anusha Bhowmick","create_timestamp":"2020-08-23T10:35:20.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1WPOKRZFHEl4QUi9Np-yx2DCQ8O3z7xq_"}],"id":"13"},"__N_SSG":true}