{"pageProps":{"articleData":[{"pk_df_blog_page_id":132,"blog_content":"<p style=\"text-align:center;\">Are you someone who has been panicking this whole time? Are you keeping an eye on the news channels every single hour of the day? Are you really losing hope, worrying about the sheer rise in the number of people affected by the second strain?&nbsp;&nbsp;</p>\n<p>Well, you are definitely not alone. A lot of young energy is wasted on constantly worrying about the future of the pandemic. The constant loss of hope among the youth is really saddening.&nbsp;</p>\n<p>But don’t worry at all, we’ve got you covered!&nbsp;</p>\n<p>We will not be sharing with you the danger that the virus poses or where you can find medical supplies. <br><br>Today, we’re just sharing how you can stay positive and be a hero of calmness, winning the war for yourself and your close ones. Here’s five ways you can stay hopeful this quarantine!&nbsp;</p>\n<p style=\"margin-left:18pt;\"><strong>1. Sleep! Sleep! Sleep! </strong></p>\n<p></p>\n<img src=\"https://drive.google.com/uc?export=view&id=15NKWsP-fNkjEuaoRq34tVuIof2aG1V6U\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n<p>Remember how we always complained on how little we get to sleep just because we have to leave early? Remember how long journeys to our colleges, schools or offices would make us lose temper so often? Well, you’ve got the golden opportunity now! With the closure of several institutions across the country, the most we can do with our world going online is to sleep a little longer. Yes, do attend classes and complete your tasks. But there’s no harm in sleeping an extra hour in the morning or having a lovely siesta in the afternoon. Refresh yourself and rest your body and mind. You’ll definitely<br>feel a lot less stressed!&nbsp;</p>\n<p style=\"margin-left:18pt;\"><strong>2. Learn something new! </strong></p>\n<p></p>\n<img src=\"https://drive.google.com/uc?export=view&id=1WNoJiEINykQqI23d3Ty3CQml5K62rZh_\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n<p>Remember how in tenth standard, you pledged to learn how to play the guitar after boards? Well what happened to that promise? Now is the perfect opportunity you may use to learn something entirely new. Play that guitar. Do that dance. Write that poem. Grow that beard. Do something different. Learn how that will make you feel. Then repeat, repeat, repeat!&nbsp;</p>\n<p style=\"margin-left:18pt;\"><strong>3. Know what you’re grateful for! </strong></p>\n<p></p>\n<img src=\"https://drive.google.com/uc?export=view&id=1v28o9RbWWViROaSyU5LvGwC_G5NLL7wq\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n<p>More often than not, we are so overwhelmed with whatever is going wrong in the world; we forget the things we are grateful for. Today, when the world is literally shattering before your eyes, make it a point to thank everything that has ever made you happy. You may even write five things you’re grateful for every morning. Drink lots of water and eat whatever you like. Find out what makes you smile. Do it or stay near it now more than ever!&nbsp;</p>\n<p style=\"margin-left:18pt;\"><strong>4. Look at old pictures! </strong></p>\n<p></p>\n<img src=\"https://drive.google.com/uc?export=view&id=1osFA5RaURdmItCcx6tIh9KLDNWJ2ieuT\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n<p>Remember how on every occasion, our mothers used to pull out an old, dusty album in front of guests? Those embarrassing childhood pictures were surely hated by most of us at times. Now with a whole lot of time at your disposal, take out the pictures once again and go down the memory lane. Which of the relatives and friends can you recognize even today? Which dressing style do you absolutely loathe now? What do you wish you remember muttering in that old picture? Spend your days revisiting the olden times and enjoy yourself and your past.&nbsp;</p>\n<p style=\"margin-left:18pt;\"><strong>5. Punch away negativity and laugh a lot! </strong></p>\n<img src=\"https://drive.google.com/uc?export=view&id=1Dj7TDLEBHiUtZJhEZeHCIsZryd-2g5-z\" alt=\"undefined\" style=\"height: auto;width: auto\"/>\n<p></p>\n<p>Do you have the problem of always laughing at serious moments? Have you ever offended someone with laughing too much on something not very funny? Well, now is the time, my friend!<br>In fact, whenever you wear a mask, you can definitely laugh under it with nobody even noticing. A day without a laugh, is a day wasted! And with the pandemic, laughter maybe the only contagious thing that you might want to catch! So keep aside your negative thoughts and laugh aloud and laugh lot!&nbsp;</p>\n<p></p>\n<p>Here’s a list of suggestions that may help you get back your hope! Don’t forget to try them out and let us know if they worked for you. Stay safe and stay home.&nbsp;&nbsp;&nbsp;</p>\n<p>Check out the <a href=\"https://www.instagram.com/p/COAj6iMJtgz/?igshid=n5eitehczm4b\" target=\"_blank\">COVID Support Circles</a>  that will be let by leading counselling psychologists!&nbsp;</p>\n<p><strong>Please click on these links to get information regarding COVID Resources:</strong></p>\n<ul>\n<li><a href=\"https://drive.google.com/drive/folders/1UpvilfxliO5U0MzwmiYHI8I8X5GZqaG7\" target=\"_blank\">Information Regarding COVID resources all over India</a>&nbsp;</li>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1hcPMvu3tV8dl8UpsNvo5Ls_11kWUZ34HSIQ1rKcKbHg/edit#gid=634296280\" target=\"_blank\">Verified Contacts of COVID resources in certain states</a>&nbsp;</li>\n</ul>\n","blog_headline":"5 Ways To Stay Positive During The Pandemic!","user_email":"ups0408@gmail.com","user_insta":"https://instagram.com/upasana_ghosh?igshid=hld19oug325w","user_facebook":null,"user_linkedin":null,"user_name":"Upasana Ghosh","create_timestamp":"2021-04-29T23:36:49.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1IrfP0gC0dHhPlS2X5DFFNx91fpWZV-QD"}],"id":"132"},"__N_SSG":true}