{"pageProps":{"articleData":[{"pk_df_blog_page_id":14,"blog_content":"<p></p><p>\tIt was 03/08/2018 when I woke up in the morning to find out that i have been selected as an intern at Desire. I was very excited to meet everyone. We soon had a meeting and everyone was introduced. Things were going great for a first few weeks. I was regular to meetings, I showed up for slum visits then after some time, things started getting boring. I then started creating excuses, missed meetings but I stayed up for slum visits. Days passed, later it was the time for admissions. We had a meeting with Raju bhaiya. It was he who shared his journey and made me realize that what mistake I was making by not being dedicated to the work there. I realized my mistake and made up my mind that I won't be taking any of the tasks lightly as it was related to someone's future. Time passed, we started visiting schools, started verification of the documents but still after lots of effort, we weren't able to get any child from our slum admitted to any of the schools . It was the most heart breaking feeling. I had worked a lot since the last few weeks but still wasn't able to help any of the child to get admitted to a school. We then spoke to Raju Bhaiya and he stood beside us. He helped us gain confidence again and we made sure that even if we failed this time we won't fail the next year. Its been a very beautiful journey from the first day but with time we were diverted from the track. It's mostly been Raju bhaiya who has stood beside us and made us realize our mistakes, supported us when we needed support. Actually, not only bhaiya, the entire team has always supported us. Its always been a family instead of an Organization.</p><p></p>","blog_headline":"I realized…","user_email":null,"user_insta":"https://instagram.com/rounak_modi_?igshid=k2dee2wh5xxi","user_facebook":"https://www.facebook.com/rounak.modi.779","user_linkedin":"https://www.linkedin.com/in/rounakmodi/","user_name":"Rounak Modi","create_timestamp":"2020-08-23T10:35:20.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1hK6FcLVjfS-Ip-CtEupG5l6tU-kLDtVs"}],"id":"14"},"__N_SSG":true}