{"pageProps":{"articleData":[{"pk_df_blog_page_id":22,"blog_content":"<p></p><p>\tSince my childhood, I had a DREAM,</p><p>\tDream that I would be a Superhero. But people around me said that Superheros are just an imagination and do not exist in reality.</p><p>\tBut the day I joined Desire Foundation I found that to be someone's Superhero you don't need a cloak or any superpowers but a little bit of Love and Kindness in your heart.</p><p>\tAn urge to get into one of the college societies led me to Desire Foundation. And now it has been more than a year, since I am a part of this Foundation.</p><p>\tMy journey started with a visit to a government school for Independence day celebration.</p><p>\tWe conducted many extracurricular activities for the children. They all were full of enthusiasm and each one of them was very talented.</p><p>\tThat day I slept with a satisfaction that we are the reason for someone's happiness.</p><p>\tAll the projects or events in desire foundation made me more fluent in my work and gave me exposures be it a visit to a slum in scorching heat, carrying more than 100 books from the 4th floor in Khawish-e-Shiksha, copy distribution etc.</p><p>\tAnother experience I want to share is when I was appointed as the Team Leader of Diwali Project.We were supposed to organize an event for slum children.I was really nervous as It was my first project as a leader. We planned to organize the event in anganbadi school.</p><p>\tAs Diwali was on Saturday that year and almost all schools are closed on Saturdays. So we first went to the principal and talked to him about this. He assured us that the school would not be closed on that day. So we were relieved and we started our preparation for the event. On the day of the event, since morning, though every little stuff related to the event was sorted but then also I had the gut feeling that something is going wrong. I ignored it and went to the school. Then we came to know that not a single child had come to school that day.</p><p>\tAfter that, we all panicked for sometime but then also we didn't lose hope and after a lot of efforts, we managed to contact the principal and then he helped us in bringing the children for the event.</p><p>\tAfter crossing so much of hurdles we finally able to make the event a great success.</p><p>\tAnd the moment when we saw the sparkle in the eyes of those children and the purity in their smile we forgot all the problems we faced, we were overwhelmed by the love of those little kids for us.</p><p>\tThat day I learnt no matter what we should never give up. If all paths are closed for your target, you should keep courage in your heart to make a new path for achieving your goals.</p><p>\tIf you would give you 100% in any work, nobody can stop you from the success.</p><p>\tDesire Foundation has helped me to make my dream come true, now I can say yes I am a Superhero and not only mine but also of thousands of people especially little children who do not even get the basic opportunities for a better life.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/kumari.sonika.1","user_linkedin":null,"user_name":"Sonika Kumari","create_timestamp":"2020-08-23T10:35:21.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1aRRrFC9DQdxkZfVW39Ug17A3kKsMTIF4"}],"id":"22"},"__N_SSG":true}