{"pageProps":{"articleData":[{"pk_df_blog_page_id":23,"blog_content":"<p></p><p>\tMy journey with Desire for last 10 months was exciting and thrilling for me. Desire foundation has fulfilled my desire to work selflessly for poor sections and people belonging to the lower socioeconomic class in our society.</p><p>\tI have had a pleasant experience as an HR intern and tried my level best to work with the dedicated teammates to form a solid team to work hand in hand together to reach a common goal for the upliftment of poor section of children.</p><p>\tDuring last 10 months, I have visited Mahimanagar slum where I got the opportunity to teach children of underprivileged class. It was painful to observe their condition, however, I enjoyed teaching these lovely children.</p><p>\tI understood that these children have a shortage of teachers, books and basic facilities including funds, thus refraining them from meeting the basic need of education.</p><p>\tThese challenges are some of the toughest challenges for a nation, where the future of the country is lacking basic amenities and education and I am proud that Desire Foundation is doing an extraordinary work to help these children to progress in education.</p><p>\tMay almighty bless all of us and give strength so that we together can reach more number of people to help them lead a better life.</p><p>\tOur objective is to catch them young and educate them with proper guidance.</p><p>\tI feel I am lucky for being able to render services to these poor children through Desire to improve the education level of slum children. Desire, in the long run, aims to bridge the gap between the people belonging to the different strata of the society.</p><p>\tLastly, I conclude that education plays a vital role in economic growth of our country and through Desire Foundation we wish to set many examples in front others and motivate more number of people to join hands with us and support our organization.</p><p>\tLet God give us enough strength to work better in future along with all our dedicated teammates and take Desire Foundation to greater heights.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/nayonika_chakraborty?igshid=f1le8omsxqav","user_facebook":"https://www.facebook.com/profile.php?id=100013254499221","user_linkedin":"https://www.linkedin.com/in/nayonika-chakraborty-568874144/","user_name":"Nayonika Chakraborty","create_timestamp":"2020-08-23T10:35:22.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1uetcYB8404OL85HErs-gFAiGPRcuSQIU"}],"id":"23"},"__N_SSG":true}