{"pageProps":{"articleData":[{"pk_df_blog_page_id":24,"blog_content":"<p></p><p>\tTo be honest, I had not expected to get selected in Desire Foundation.I came to know about this foundation through my friends in the first year.I remember the first day of my interview, I had no plans to attend for the interview and I had not applied for it even, but then it was my roommate who told me that they are taking on spot registration and applicants. I thought of giving it a try. With no preparation, I sat at the interview. I was not at all satisfied with my interview but to my luck, I was selected!</p><p>\tSo then, my journey as an intern began with Desire. I got my internship letter from the sales department. The seniors and the administrators of the section are very humble and helpful. In our first general body meeting, the seniors introduced themselves and informed about the aim of Desire Foundation, discussed about the projects etc. I got my first experience as a member of Desire Foundation when I volunteered on independence day in a govt. school where we conducted many extra curricular activities for the children. Then I got selected for the project Adhyayan where I am positioned in the content team and have also volunteered for surveying, which helped me to discover the new and fresh. It gave me a professional platform to showcase my skills and also to learn many new skills. It increased my communication skills. Again, I volunteered in the Diwali project in an Anganwadi where we lighted up some faces with out decorations.</p><p>\tI am really looking forward to more of experiences with desire foundation and learn many things in the process.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":null,"user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/madhurima-roy-94931b12a/","user_name":"Madhurima Roy","create_timestamp":"2020-08-23T10:35:22.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=103EvQgHwNDoQzjFmGZBZyO_2PBy_qijZ"}],"id":"24"},"__N_SSG":true}