{"pageProps":{"articleData":[{"pk_df_blog_page_id":29,"blog_content":"<p></p><p>\tLosing everybody in the fantasy world wherein I create a scenario that picturesque turns out to be the adjective even for the slightest thing monotonous has been my passion ever since I was a child. But to pursue it in a way to make a livelihood out of it could never supersede than being a mere second thought. And with the dawn of a new day in 2018, It was ˜Desire' who not only brought back the lost photographer in me but also helped me to add a new dimension to my skill.</p><p>\tThere were times when people were jaded after the slum visits, I made sure to capture the lighter moments out of it that can get any of our members rolling on the floor laughing recollecting those feelings again. By the end of this one year little did anyone know that a would-be software engineer had already donned the hat of a professional shutterbug ever since he was a part of Desire Foundation.</p><p>\tOn my part of the journey in Desire, I won't say that it proved to be pretty easy for me because as it is pretty much clear that we Desireians have a goal that attributes to walking on a road less travelled. I have seen times where perpetually failing at the eleventh hour of our aim brought no ray of hope for us to work further but it is to our coordinators who boosted the perseverance in us and helped us believe in ourselves. Their guidance helped us make wonders at our work.</p><p>\tLike my counterparts, Being a part of Desire nurtured me in growing up as a better individual who knows how to fight all odds in order to chase my goal no matter the extremity I need to go through to pursue it and how excruciating it proves to be.</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/westerosi_photographer?igshid=1mwdv8s1w1aw5","user_facebook":"https://www.facebook.com/miisterwayne","user_linkedin":null,"user_name":"Ronit Kumar Das","create_timestamp":"2020-08-23T10:35:23.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1Jq1PNf0gh0-tuoy2iYxo1VKUDhW1mq-2"}],"id":"29"},"__N_SSG":true}