{"pageProps":{"articleData":[{"pk_df_blog_page_id":30,"blog_content":"<p></p><p>\tSince my childhood, I had a dream to do something for society. But the day I joined Desire Foundation I found that opportunity to do something for the society.</p><p>\tWhen I first entered this college, my only aim was to get into academic progress and get settled. Gradually, as days passed, I started looking around. Then, I got to know about Desire Foundation from my classmate in the first year. I remember the day of my interview  The interview was on a Sunday morning in July. I was very excited. Everything went well and I became a part of the Desire Family.</p><p>\tIn our first general body meeting, the seniors introduced themselves and informed about the aim of Desire Foundation, discussed the projects etc. I got my first experience as a member of Desire Foundation when I volunteered the survey to Banafulla Slum.There are so many kids out there who have not got the opportunity to go to a school and I am really thankful to Desire for helping me spread happiness among them.</p><p>\tI was appointed as the Team Leader of Niladri Vihar Slum of Adhyayan II Project. I was really nervous as a team leader of the biggest slum of this project. The struggles are huge. Getting a child admitted to a school under RTE is a long procedure. But, the journey is awesome because of the people working here as a team and moreover as a family.</p><p>\tAfter crossing so much of hurdles we finally able to admit 68 children in schools and make the project successful. That day, when I saw the eyes sparkling with the happiness I said that Desire Foundation has helped me to make my dream come true, now I can say yes I have done something for the society.</p><p>\tIf you would give you 100% in any work, nobody can stop you from the success.</p><p>\tBeing a part of this family for more than 1 year has brought about surprising changes in my mind. I have become more confident, professional and very happy to help innocent lives, giving them the spark of education that will light many lives. Helping others is what I've learned from grandfather and implementing it from desire. It gave me tremendous satisfaction. Desire stands apart from the rest of the social working societies because Desire has a family where interns, coordinators and leads work and enjoy.</p><p>\tFrom an Intern to a Coordinator's journey is awesome. It gave me a professional platform to showcase my skills and also to learn many new skills. It increased my communication skills. I am looking forward to more of experiences with Desire Foundation.</p><p></p>","blog_headline":"Service till date and more to do","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/profile.php?id=100007828155857","user_linkedin":"https://www.linkedin.com/in/aniruddha-mondal-7bb600155/","user_name":"Aniruddha Mondal","create_timestamp":"2020-08-23T10:35:23.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1tAaDMLR_VGAEQhcjVjbRyeK_1xxS3qj4"}],"id":"30"},"__N_SSG":true}