{"pageProps":{"articleData":[{"pk_df_blog_page_id":37,"blog_content":"<p></p><p>\tFor a student, his life is carved into shape in two places: Home and the educational institution he’s in.</p><p>\tThese places provide him with proper skills and knowledge and also imbibes a spirit of well being for himself and the society.</p><p>\t</p><p>\tWhen I first entered this college, my only bull’s eye was to get academic progress and get settled. Gradually, as days passed, I started looking around, realizing the certain areas of duty that I have towards The Almighty, towards my parents, and towards this society. I was privileged enough to receive an education and that also a proper one. But what about those who weren’t?</p><p>\tThese questions kept coming to my conscience everyday.</p><p>\tAll my questions were answered by one name,</p><p>\t“Desire Foundation”.</p><p>\tI got to know about Desire Foundation from my roommate, and hence started a life-changing experience of awesomeness! Determined I was to do my bit for the society and social work became as important to me as my career was.</p><p>\tThe Independence day project was my personal first of the journey, and after attending the project with Desire, my whole notion about “Boring social work” changed. Being a part of this family for 1 year has brought about surprising changes in my mind. I have become more confident, professional and very happy to help innocent lives, giving them the spark of education that will light many lives. Helping others, unconditionally is what I’ve learnt from Desire and implementing it has given me tremendous satisfaction.</p><p>\tI believe that however one can, one should support and contribute both efforts and financial aid for the maximum literacy rate.</p><p>\tWith Desire, I am happy I’m able to do my part for them.</p><p>\tAs I finish writing this, I know that more awesomeness awaits!</p><p></p>","blog_headline":"My Journey","user_email":null,"user_insta":"https://instagram.com/soumyakar_official?igshid=1w2uxwwdaoloy","user_facebook":"https://www.facebook.com/soumya.kar.54","user_linkedin":"https://www.linkedin.com/in/soumya-kar-923155127/","user_name":"Soumya Kar","create_timestamp":"2020-08-23T10:35:24.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1TXr7GZ33tfLZoncYzJyzgOaDjdtI1GyQ"}],"id":"37"},"__N_SSG":true}