{"pageProps":{"articleData":[{"pk_df_blog_page_id":38,"blog_content":"<p></p><p>\t|| Vakratunda Mahakaya</p><p>\tSuryakoti Samaprabha</p><p>\tNirvighnam Kurumedeva</p><p>\tSarbhakayashu Sarbadha ||</p><p>\tLord Ganesh, the son of Lord Shiva and Shakti, is the most powerful of all gods. He provides knowledge, prosperity, fortune and is also the destroyer of obstacles. Lord Ganesh is also known as the lord of success, therefore, people believe that his grace is invoked before undertaking any task with incantations as ˜Aum Shri Ganpatiya Namah</p><p>\tWe often hear people saying ˜ Ganpati Bappa Morya with devotion. Now the question is who and why Morya? Morya Gosavi the famous devotee of Lord Ganesh of 14th century who lived in Chicward, Pune. He was a crazy devotee of Lord Ganesh, pleased with his bhakti, one day Ganesha asked him, what Vardan he would wish for him. All, Morya said was, he would want his name to be always associated with him. And also, Morya has formed Maharashtra. So, Ganesh Chaturthi is celebrated at Maharashtra on a large scale. The occasion usually falls on the fourth day of the waxing moon period in Hindu month of Bhadrapada, which eventually falls in the August and September of each year. According to Indian culture deities idol get worshiped similarly, Ganeshas idol is usually made up of clay and paints. People bring Bappas Murti to their home as they believe that Ganpati will bless them with happiness, peace, health, wealth, prosperity. Usually, Ganesh Chaturthi is celebrated for 11 days, where Bappa arrives being a guest. The whole country welcomes Lord by setting up theme-based Mandaps, roads are lit up with colorful lights similarly at people houses Bappas settles down in a clean place at the corner of the house decorated with fresh flowers and lights. Modaks and laddus are some offerings made to the Lord as prasad. People enjoy this period with their families. And 11th-day people bid farewell to Ganpati by dancing with joy and also in a hope that he would come early next year. And then go for immersion of idols into the river.</p><p>\tWith the passion of celebrating the festival, we generally forget the hazardous impact of immersion on the environment. The Idol of Ganesh is generally made up of clay and plaster of Paris, plastic cement. Toxic paints are also used in decorating idol. After immersion, the ingredients of the statute does not completely dissolve in the water which then leads to water pollution. Due to these concerns, we as a responsible citizen of our country should give a try to celebrate Ganesh Chaturthi in an eco-friendly manner this year, by letting the statute disintegrate in the barrel of water at home. After a few days, the clay is spread in the garden, which in turn will not give rise to water pollution. So lets take this initiative and celebrate Bappas incoming with a bang.</p><p>\tGanpati Bappa Morya Mangal Murti Morya.</p><p></p>","blog_headline":"Ganpati Bappa Morya Mangal Murti Morya","user_email":null,"user_insta":null,"user_facebook":null,"user_linkedin":null,"user_name":"Lithi Lagna Mohanty","create_timestamp":"2020-08-23T10:35:24.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1xPmWkcTWNyt_OYni2sHuofOw1UG9sPzl"}],"id":"38"},"__N_SSG":true}