{"pageProps":{"articleData":[{"pk_df_blog_page_id":39,"blog_content":"<p></p><p>\tFew days back while walking through the ups and downs of my life, I had the fortune/misfortune (as you think) of coming across a Pakistani. No, I didnt feel anguished or disgusted , neither did I feel the need to walk away. I had a long talk with this person who with all his heart was deeply pained by the deeds of his ill-minded countrymen. Rather, he shared his own misfortune of facing an almost fatal disaster at Kuwait where he was saved by the thin threads of luck . It was highly shocking to see such an old man pouring out his sorrows. Well this got me into thinking. Why do we blame someone who never did anything wrong for something as awful as the destruction of life and property. Why do we so blatantly cultivate deep hatred and disgust even for innocent. Just because they had their roots at a place where a few rotten minds have created havoc throughout the world, even their sight has become repulsive. Why so? Why dont we put ourselves in their shoes and for once go through the pain of being treated as monsters and to experience the sorrow of watching their country, their motherland be universally blamed for being a safe heaven for the inhuman devils. I believe, life and destiny in all its form has never been blissful to them. We can change that, you can change that by treating them has as a normal human being with dignity and with respect. I am not asking anyone to become an all-forgiving saint, I am only requesting to at-least release the ones who are not guilty of any disrespect. Lets not forget that the gallows and trysts of destiny are never predictable and someday we might need their help and support. Most importantly, it always feels good to be a sunshine in someones life, still its your choice.Take a wise decision and be the change</p><p></p>","blog_headline":"Guilty of Innocence","user_email":null,"user_insta":null,"user_facebook":null,"user_linkedin":null,"user_name":"Shubham Mishra","create_timestamp":"2020-08-23T10:35:25.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1izG9_u7XcQNx229Qj6X1aZLG1lgP_5_l"}],"id":"39"},"__N_SSG":true}