{"pageProps":{"articleData":[{"pk_df_blog_page_id":40,"blog_content":"<p></p><p>\tThe sun was blazing with heat, making it impossible to stay outdoors. This is a common climate in Bhubaneswar, especially during the month of April-May. Summers here just seems unbearable.</p><p>\tThe scorching sun has become a part of our daily schedule, in these 2 years. I wiped the sweat off my forehead with a handkerchief, silently cursing. Just then, I saw, our regular golgappa-wala there, standing with his cart.</p><p>\tIve always been fond of this delicacy, to such an extent that I can eat them at any time of the day.</p><p>\tSo there I was, standing in front of golgappe wale Bhaina, asking him, œBhaina, jyada khatta-teekha banana.</p><p>\tœAapka wala teekha, Didi? he smiled.</p><p>\tœHaan haan I smiled back.</p><p>\tWhile he was busy mixing the spices and preparing the golgappas, I started a chat with him, he asked about when the college would close for the summer vacation, I replied, saying that vacations would start from 6th May.</p><p>\tœBhaina, in such a scorching heat, you stand under the sun, to sell golgappas?</p><p>\tI have to earn a living, Didi, he said, sounding low.</p><p>\tWhen asked about his family, he said that they live in some remote village of Berhampur, as he cannot afford to keep them with him in the city. He is the only breadwinner of the family that comprised of 6 members, his old parents, his wife and 2 children, who are studying in a school there.</p><p>\tœDont you miss your family, Bhaina?</p><p>\tHis eyes turned moist when I asked this question.</p><p>\tHe said that he gets to meet his family very rarely, as he is a daily wage earner, and taking a day off meant a loss. His only dream is to get his children educated and bring his family to Bhubaneswar.</p><p>\tHe also said that the sales go down when the college remains closed, and there are few people in the campus.</p><p>\tBy this time, the golgappas were ready. I ate them to my hearts content, thanked him, with a promise to meet again when the college would reopen.</p><p>\tGhar jaake maze karna, Didi- he said, as I left the stall.</p><p>\tThat night, my thoughts didnt let me sleep. I wondered, how a simple man, whos deprived of so many things in life including a happy family life, serves everyone with a pleasant smile on his face, despite the exasperating heat, and how we, in spite of leading such a good life, are never contented with all that we have.</p><p>\tHis hopeful eyes gave me a new meaning of life, and I realised that I should stop cribbing about all that I dont have, because what I have is also a distant dream for many, and that no matter how hard life gets, there is still never ending hope with every mornings sunshine.</p><p></p>","blog_headline":"Hope - a never ending force","user_email":null,"user_insta":null,"user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/pinkymukherjee18/","user_name":"Pinky Mukherjee","create_timestamp":"2020-08-23T10:35:25.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=11Vy8jUfxWJAG635PPMY9zADyIHuAdxdj"}],"id":"40"},"__N_SSG":true}