{"pageProps":{"articleData":[{"pk_df_blog_page_id":47,"blog_content":"<p></p><p>\tHe stared at his sons contact number, eagerly waiting for his call. It has been days since he had heard his sons voice. A sudden thought sank his heart and he started getting flashbacks about his past, his near death experience. Smoke in his eyes, that smell of tar, suffocation and cacophonous noise of bullets and screams of dying men. The feeling of loosing his best friends and taste of blood in his mouth, loosing conscious, remembering his family members for the last time as the shrapnel struck him. Saying goes when you die, the deeds you have done in life, reflects in front of your eyes! As he was breathing his last he understood it more properly. What makes a person a Martyr! and the honour of giving up ones life and the feeling of protecting millions of lives is so beautiful. He was overwhelmed with happiness and pride as he gasped his last.But miraculously, he was revived, as he looked down at his amputated leg. What if his son didnt get a chance!</p><p>\tAt that moment he got a phone call informing that his son didnt make it. Alas! His son didnt get a chance. He felt broken, thinking he was punished by fate, as he had to outlive his son. The only thing which could console him was that his son was a Martyr and he was the proud father of this son, who died for a cause. And that, his sacrifice saved lives.</p><p>\tAnd the story goes for all the soldiers who died, fighting for countrys freedom. These are the selfless, brave people who gave up their lives and loved ones for us so that, we could breathe and sleep peacefully. These people dont feel pain and are immortal. They shape and make history, the very ones we read in our books. As their families lament for the loss of child, brother or sister, husband or wife, we celebrate our victory.</p><p>\tTo honour their unrelenting devotion, sacrifice, not just theirs but the sacrifice of the ones who lost them, we celebrate Martyrs Day on 30 January every year in India. They can be erased from physical existence but not from hearts. To remind who are the ones behind the development, success, prosperity of the country and all the cheerful faces of free men we celebrate this.</p><p>\tLet us commemorate the martyrs and their sacrifices!</p><p>\tLet us keep a two minute silence to pay tribute to them!</p><p></p>","blog_headline":"Martyrs Day","user_email":null,"user_insta":"https://instagram.com/spriha_mandal_?igshid=1jx4xf1qkzg35","user_facebook":"https://www.facebook.com/spriha.mandal.330","user_linkedin":null,"user_name":"Spriha Mandal","create_timestamp":"2020-08-23T10:35:26.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1E4G00BRPAdgBWDj7gQ82jX-p5rCGSipM"}],"id":"47"},"__N_SSG":true}