{"pageProps":{"articleData":[{"pk_df_blog_page_id":48,"blog_content":"<p></p><p>\tMuharram (this year starts from 21st September) is the first month of the Islamic calendar. It is one of the four sacred months of the year. Sunni Muslims fast during this day, because it is recorded in the hadith that Musa and his people obtained a victory over the Egyptian Pharaoh on the 10th day of Muharram and so accordingly Muhammad asked Muslims to fast on this day that is Ashura and on a day before that is 9th, while Shia Muslims mourn the death of Imam Hussain and his family, respecting the sacrifice of the martyrs by praying in abundance and refraining from all joyous events. Shia Muslims fast on the 10th day of Muharram and in addition, there is an important Ziyarat book, the Ziyarat Ashura about Hussein ibn Ali, is read by Shia Muslims on this day.</p><p>\tNow, I know the majority of the people reading this right now are clueless about most of the things I wrote in the previous paragraph. I was too when I was learning about Muslims and their culture and the importance and significance of their each and every festival. Let me give you a brief description of the important people and their stories.</p><p>\tFirstly, There are two main categories, there are Sunni Muslims and Shia Muslims.</p><p>\tFor Sunni Muslims, the 10th day of Muharram(which is called Ashura) is considered holy. As on this day, Musa(Prophet of Israel) and his people fasted and followers believe that Allah saved the Children of Israel from their enemy(Egyptian Pharaoh) by creating a path in the Red Sea. (The entire story is really interesting, it involves a lot of sacrifice and heroism, I cant tell you all about it so I just gave the summary, you can always google it.) So, Sunni Muslims fast on this day of Ashura and the previous day(9th day of Muharram) to appreciate God and his powers.</p><p>\tFor Shia Muslims, Ashura is considered a very sad and gloomy day. Most of you have seen news/documentaries and know about the processions on the streets, Tazia, its a Muslim passion play where a replica of the tomb of Hussain is carried in processions during Shiite festival, with mourners in black beating their chests. Some may have seen men, even little boys hitting themselves with chains, blades, swords.</p><p>\tThe reason behind this sorrowful day is a massacre caused by disagreements over a succession of Prophet Muhammad. The third Caliph(Caliph is a Muslim ruler, mainly successor of Muhammad), Uthman, was killed. The fifth Caliph, Hasan who was Muhammads grandson, was abdicated, letting Muawiyah(Muhammads brother in law) take charge for the duration of the latters life. But later Hasan was poisoned. Muawiyah named his own son, Yazid, as successor. This was not acceptable to some leaders, certainly not to Hussain, who was Hasans younger brother.</p><p>\tYou see the family politics? So now, there was 1.Yazid, the successor, son of Muawiah, and 2. Hussain, grandson of Muhammad. Obviously, Hussain was supposed to be the next Caliph but as his brothers assets were with Muawiah, Muawiah made his son the next Caliph.</p><p>\tHussain refused to accept and endorse Yazid as Caliph and chose to leave Medina with his family and supporters. They headed towards Karbala (now in Iraq) but found no safe refuge. Yazids forces surrounded them, neither letting them proceed towards Damascus nor letting them return to Medina. The soldiers also cut off access to the river. Everyone in the group was starved and parched.</p><p>\tFinally, there was a battle. There were only 72 men on Hussains side and all died, barring one. Even though they knew they all were going to die. They still fought with the utmost courage. We dont know exactly how many women and children survived. They were held captive and, the story goes, their veils were torn off to humiliate them publicly.</p><p>\tBut they were determined not to forget nor to let others forget. What Yazid wanted was to get rid of the opposition. The only way to oppose him was to keep the memory of dissent alive.</p><p>\tMoharram is about remembering. It is a salute to those who stayed to fight even though death was certain.</p><p>\tBut it is not about merely feeling their pain. It shouldnt be reduced to ritual enactments of bloodshed. It certainly shouldnt be about picking a side or a name to hate. It is a time to remember how great tragedies are the result of someone wanting power and dominion at any cost. It is a time to remember the full cost of each human life. Far too often, we seem to forget that.</p><p></p>","blog_headline":"Muharram","user_email":null,"user_insta":"https://instagram.com/barbie_swastika?igshid=1xfxqqhcicf9g","user_facebook":null,"user_linkedin":null,"user_name":"Swastika","create_timestamp":"2020-08-23T10:35:26.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=13I9hhnjUvPT4iwIguGl-2tbVf2ENzDG7"}],"id":"48"},"__N_SSG":true}