{"pageProps":{"articleData":[{"pk_df_blog_page_id":5,"blog_content":"<p></p><p>\tDedication, contentedness and teamwork are the three most important things I have learned here.</p><p>\tI joined Desire Foundation as a Sales Intern in my second year of college, having no prior experience in sales as well as social work. But I am blessed to have such helpful and experienced seniors who are ready to help us in all aspects who made things a lot easier than it seemed.</p><p>\tFrom visiting slums to outdoor copy selling, everything was an experience of a lifetime. Visiting schools and slums under every circumstance just with the hope to fulfill someone's dream taught what the sense of contentment is. From convincing school Principal to creating awareness among parents about the importance of quality education made me aware of my responsibilities and developed my personality. The best part here is how we celebrate every festival with these lovely kids and share each other's happiness amplifying it even more. After all, true joy lies in the act of giving.</p><p>\tI still remember how excited and nervous I was on my first day of slum visit. The eyes full of hope and those smiling faces, even after not being able to afford most necessities of life, gave me an instant motivation to work even harder.</p><p>\tDesire has been an integral part of my college life. The skills and memories made here is something which is going to be with me for the rest of my life. It gave me a family away from home.</p><p></p>","blog_headline":"Alone we can do so little, together we can do so much more","user_email":null,"user_insta":"https://instagram.com/shrutaay_k?igshid=1rgwhcqmfc5v3","user_facebook":"https://www.facebook.com/shruti.keshri.12","user_linkedin":"https://www.linkedin.com/in/shruti-keshri-581aa9159/","user_name":"Shruti Keshri","create_timestamp":"2020-08-23T10:35:17.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1yof_Vry29pGHyxVrpp16DyI_TaKOCY5U"}],"id":"5"},"__N_SSG":true}