{"pageProps":{"articleData":[{"pk_df_blog_page_id":51,"blog_content":"<p></p><p>\tSo, yes. The world is pretty much the same from where I left it. The dust still gathers on my table, the moss still grows on the corners of the verandah, and the lights have gotten dimmer than ever. What really has changed, is how I can see my parent suffer, and how I can see him not suffer, because I died. I died, yet Im able to regret every day, of the day I jumped off that terrace, because he didnt want to love me anymore. And theres nothing I can do about it now.</p><p>\tStudents, especially young adults are extremely vulnerable to suicidal ideation and are the most common victims of suicide. Unfortunately, most people just bottle up their suffering instead of letting people know of their feelings and thoughts. Doing so however only corrodes ones own soul. The best way to deal with pressing burdens like these is to share it with others. If you look around you will find people who are willing to listen and also people who have gone through a similar experience and come out of it stronger. They can be your friends, your relatives or even a kind stranger on the internet.</p><p>\tSuicide has turned into an epidemic of sorts affecting people across several age groups, young and old and several social classes, from regular middle-class civilians to celebrities. Recent news like the Blue Whale game demonstrates how vulnerable some individuals can be and how easy it can be to prey into their insecurities. It is undoubted that the victims of the game had several underlying issues like neglect and lack of an outlet to vent their thoughts.</p><p>\tWhenever you feel that life has you down and you feel unimportant and purposeless, try making a child smile. Try bonding with that sweet, pure innocence and relish their unfiltered happiness as your own. That will remind you that there is so much more to life and yourself than what you have been seeing all along. This Suicide Prevention Day lets make it a point to spread positivity and let people around you know that there is help available for them and in this cruel world that has pushed them into a corner, they arent alone and theres always light after the dark.</p><p></p>","blog_headline":"STOP - You’re killing the wrong person","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/titikhyu.dixit","user_linkedin":"https://www.linkedin.com/in/titikhyu-dixit-13a339156/","user_name":"Titikhyu Dixit","create_timestamp":"2020-08-23T10:35:27.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1KS8pbQYXeb0GwdExj339vOWogEm3e_N1"}],"id":"51"},"__N_SSG":true}