{"pageProps":{"articleData":[{"pk_df_blog_page_id":53,"blog_content":"<p></p><p>\tIf the Deaf are to hear, the Sound has to be very Loud, said Indian revolutionary Bhagat Singh.</p><p>\tConsidered to be one of the most powerful revolutionaries of the Indian Independence, September 28 marks the birth anniversary of Bhagat Singh. Born in 1907, into a family in Banga village, Jaranwala Tehsil in the Lyallpur district of the Punjab Province of British India, Singh inspired thousands to take up the cause of the freedom movement.</p><p>\tShaheed Bhagat Singh at one point allegedly renounced Sikhism and adopted an atheistic anarcho-communist philosophy “ expressing admiration (sometimes in his written publications) for radical ideologues such as Leon Trotsky, Vladimir Lenin and Karl Marx.</p><p>\tHe dreamt of a free, egalitarian society “ a land where Hindu, Muslim and Sikh would be equal and where invidious notions of caste and higher status would be abolished. Unfortunately, this dream has not been realised. Bhagat Singh was an avid reader and his choice of authors was diverse, but consisted mostly socialist writers such as Maxim Gorky, Charles Dickens, Lenin.</p><p>\tBhagat Singh, a socialist by principle and a revolutionary at heart, committed two major acts of dramatic violence against the British in India. This led to his arrest and execution at the age of 23 years. However, his arrest, the shady implementation of the execution and the aftermath is written in bold in the pages of history. It is correctly perceived that the seed of revolution sowed by martyrs such as Mangal Pandey were provided the much needed impetus in the form of fodder by revolutionaries working on the path established by Bhagat Singh and his team, viz. Rajguru, Sukhdev and Chandrashekhar Azad.</p><p>\tHe inspired a lot of Indian youth to fight for independence, back in the first half of the Twentieth Century. Even today, Singh is an idol for all, and there are memorials, statues, and movies devoted to keeping his memory alive.</p><p></p>","blog_headline":"“I am a man and all that affects mankind concerns me.”- Bhagat Sing","user_email":null,"user_insta":"https://instagram.com/vedant.shr1vastava?igshid=tlrr1enxljy5","user_facebook":"https://www.facebook.com/vedant.shrivastava.37","user_linkedin":null,"user_name":"Vedant Shrivastava","create_timestamp":"2020-08-23T10:35:27.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1u01JTjP9eB_tOFfXjyJygVnA-tmOLssW"}],"id":"53"},"__N_SSG":true}