{"pageProps":{"articleData":[{"pk_df_blog_page_id":58,"blog_content":"<p></p><p>\tOh my God, a day so special to me.</p><p>\tIt gets me cheery as the clock strikes twelve. Calls after calls and texts after texts that wish me many happy returns of the day. It feels really overwhelming to get loads of love on one single day that it, at a certain point of time, leaves your eyes watery. Believe me, you truly feel like a star as people shower you with all the emotions which get you to feel that you are on cloud nine. So, this was the scenario for me till midnight when I finally got to sleep.</p><p>\tBut as I woke up, it did not feel like its my day, no preparation for the house party, no urge to dress like I am the prettiest woman. Lastly, NO Celebrations at all.</p><p>\tI had especially bought my favourite A-line gown to wear on my special day but now what is that for? Its lying in my closet. Can you really imagine how would that feel to have your best sweet dish before you but you cant eat? Yeah, you got that, right. It sucks to have felt so and I felt the same way.</p><p>\tI had all of my friends, family and relatives in the town. But could never really call them to come up and do you know the reason why? Quite obvious, the disastrous Corona Virus. It is at that moment I realised that Corona had hit me hard. My special day was just like any usual day. Little did I imagine that it was how my last teen birthday would be.</p><p>\tIts not just the birthday peeps like me who have been taken a toll on amidst the Corona Virus outbreak. Beginning with the eight-year-old child to an eighty year old elderly, Covid-19 has scared everyone to death. To send our loved ones away from the house seems no less than sending them to a warzone. Though we feel that there are no worries, how come we will catch this deadly virus but deep down we have to face the music that this virus doesnt come to you by asking your caste, creed, religion or race, it attacks you if you get a little bit careless.</p><p>\tMany cities have lockdown but even for those who dont really have it, the situation is no less than a curfew. Forget about the celebrations, it has been days since we stepped out of our homes. But during this time of crisis, the only way to save yourself and the world is just by staying at home.</p><p>\tFor a person like me who had her birthday, I might feel like a trainwreck but lets have an optimistic approach towards life.</p><p>\tLook, for how many lives you can save when you avoid every possible gathering and if just because of you even if a single person is prevented to catch this virus, you are the nobleman here. During this chaos, lets come together and have balls over this pandemic, not just for you but for your loved ones.</p><p></p>","blog_headline":"Covid 19 The Life-Threatening Malady","user_email":null,"user_insta":"https://instagram.com/manikaswiftie?igshid=uvumrlynptid","user_facebook":null,"user_linkedin":null,"user_name":"Manika Sharma","create_timestamp":"2020-08-23T10:35:28.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1q6iCpNbS1mt1Asgp_AHzmsicNnBsjwi6"}],"id":"58"},"__N_SSG":true}