{"pageProps":{"articleData":[{"pk_df_blog_page_id":60,"blog_content":"<p></p><p>\tItd been raining for four days straight and the water level hadnt lowered down even a bit. Our cave area was completely filled with water, and not only us, but also the entire area of Kaziranga was submerged under water due to two massive waves of the flood. Our community decided to shift Flood: which is greater in height, to avoid the stagnant water thats accumulated.</p><p>\tAs the rains slow down gradually, I realized that the water someday will go away, when it stops raining, but whatll never come back is Kai, my brother.</p><p>\tWe were a family of three, when Kai and I were born, in the cave, by the Banyan tree. This little cave has been home to us since the times when we were Cubs. In our community, we dont fear anything, but this time we were all pretty worried by the constantly rising level of water and what it meant. We managed to survive the first time, it was the second that took away my brother from me. That night, was a night of the disaster, when along with heavy rains, came by the huge wave of water, washing away hundreds of deer, hogs and other smaller animals. It was when the elephant herd had decided to move to a higher area, and so did all we. It was during this relocation, when Kai got caught between another mighty wave, that broke out of the frontal area of the forest. That, was the last time we saw him alive. 104 tigers, and only the four years old had to get trapped between the elephant herd. It is heard that his body was found by the Humans of the forest department. Itd been 4 days hed been lying dead by the water, before they found his body. Four days to the flood, and yet we couldnt get to see his body once. We just lost him</p><p>\tWhat upsets me, is that nobody cares as much about me losing my brother, and we losing one of our family. Yes, there are hundreds of us now, and the humans have made it an issue to preserve our community. But how much are they really doing? If only we could voice our sorrows, during natures wrath, if only we could demand our Rights from the Government. I hear theres another flood in the other side of the country, the place thats given more aids and attention? How is that disaster any better to be given attention to, and this any lesser to not even be a topic of discussion? Humans are a weird kind. They have priorities for all the wrong issues, and it becomes a problem when they have a direct influence on our survival.</p><p>\tSheena, whos recently transferred to the national park, from a nearby zoo, knows a lot about Humans, and she always talks about how they are very excited to get a glance of us and how they even fear us, sadly our population, our existence is in a crisis Because of their negligence. The caretakers of this park, who live around, used to be very caring to us, they wouldnt disturb us in any way, and would also make sure no other human comes to hunt within this park. But, my brothers death seemed to have caused no remorse in them. They, being larger in number, have made it difficult for us to survive the worst, and have nothing to do about it. It is my sincere request to anyone whos concerned, that our community is equally important as the humans are, and with every passing day, were losing one of us to the man-made catastrophe. If this doesnt stop, therell be a day when nobody will ever be able to hear a roar again.</p><p>\t-A tiger of Kaziranga</p><p></p>","blog_headline":"Flood - Happens only in Metros, An emotional plea by a tiger","user_email":null,"user_insta":"https://instagram.com/annveshaa?igshid=1ewndxmijqavi","user_facebook":"https://www.facebook.com/acap1413","user_linkedin":"https://www.linkedin.com/in/anwesha-chakraborty-b90b6016b/","user_name":"Anwesha Chakraborty","create_timestamp":"2020-08-23T10:35:29.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1xDUdZDybiGTAIVVbdS_8bnNOMyvAnhYU"}],"id":"60"},"__N_SSG":true}