{"pageProps":{"articleData":[{"pk_df_blog_page_id":61,"blog_content":"<p></p><p>\tWow, unbelievable¦ , Its amazing, though I knew from the beginning, but it never felt so important being an Indian ! As Karan, Hrithik Roshans character in ˜Lakshya expresses his awe, I wonder How will it really feel like standing at the L.O.C.!!</p><p>\t</p><p>\tWelcome to the time immemorial, irrational war between probably two of those amazingly versatile and beautiful nations¦ And the main ingredient in this riff , which tears apart every last inch of prospective peace between the two nation: Kashmir. I wonder, after a few more artillery fires, will there be enough people left in that heavenly scenic city, so as to belong to any particular country?? People are dying at a constant rate, the mortar firings and ceasefire violations are never-ending! Talks are on, as they always do, just on pen and paper! But, people are still hopeful, if not all of them, but those insecure, country-loving, peace-seeking are still hopeful. Hopeful that, someday, they will wake up in a house, not hounded by bombings scare, their children playing freely, their smile not suppressed in the horror of a curfew!</p><p>\tTalks are on¦ Indias BSF(Border Security Force) and Pakistans Rangers have met recently to hold further discussions on the recent ceasefire violations, which first began in August and later escalated to a gruesome picture in late November, killing many, and disrupting the valley¦ I hope ,with loads of people that someday, Kashmirs beauty, it homeliness will drown its violent side. And, people on both sides of the border will be as cordial as ever!</p><p>\tStill, today, if you happen to visit Kashmir, youll return with a peaceful mind , and the serenity will rob you of your heart. Maybe, because no one understands the meaning of Tranquility more than them, or the Jawans of Indian Army, who are on duty, 24X7, 7 days a week!</p><p>\tAnyway, the heart and the mind always say, Jai Hind!</p><p></p>","blog_headline":"KASHMIR Still Peace prevails…","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/subhangee.august","user_linkedin":null,"user_name":"Subhangee Sahoo","create_timestamp":"2020-08-23T10:35:29.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1ZAwjdPw-c7JVw7NF1cNugOI0eEby1ho5"}],"id":"61"},"__N_SSG":true}