{"pageProps":{"articleData":[{"pk_df_blog_page_id":62,"blog_content":"<p></p><p>\tThe constitution of India gives us the freedom of speech and expression, but on the other hand we have a law which states that if an act in public annoy others, and if others consider it to be obscene, then the people involved in the act shall be penalized.</p><p>\tHow would you define the word ˜obscene?</p><p>\tSomething which is offensive, indecent, repulsive, right? And on what grounds do we get to decide whether an action is obscene or not? Let us take a few examples- For some people peeing in public is not offensive and for some it is, some find smoking trendy and some find the smoke suffocating. Eve teasing is indecent but most of the people simply ignore those hooligans teasing a girl instead of helping the girl out but if the same people find two people expressing their love then Indian Culture is at stake.</p><p>\tDont you think that penalizing people just because of the fact that they were showing their affection towards each other is a bit too harsh? Chasing them, threatening them, beating them up, doesnt this come under obscenity? If the violation of law is under consideration, then dont you think that the groups involved in harassing people who were publicly displaying their emotions are themselves doing something against the law? If they cannot preserve the law then how do they claim they are preserving the Indian culture? Moreover, the police (the moral police) is not present when a girl is being molested, or when a person is smoking, or when some rich spoilt brat runs over his car on the people sleeping on the footpath but when it comes to harassing couples the MORAL police is always present and the fine issued varies (depending on how much a person can give). Do such people have the right to call themselves preservers of law?</p><p>\tConsidering hugging or kissing in public an obscene act totally depends on a persons mentality and the kind of environment in which he/she has been brought up. But there is a difference between a peck on the cheek and smooching. Let us take an example-suppose you see a couple smooching in a public park, your most obvious reaction would be to ignore and at most you might leave that place and go sit somewhere else. However, imagine the same situation, but with your parents and grandparents as the spectators. Wont it be awkward for them? Leave them, wont it be awkward for you? A peck on the cheeks or a hug and holding hands in public may be considered but a long smooch-is it acceptable? Think for yourselves. Dont you think that public display of affection should be allowed but with certain restrictions?</p><p>\tWestern countries are preserving their culture, but we have been brought up in an Indian society. So the responsibility is on us to interpret our culture in a better way and preserve it accordingly.</p><p></p>","blog_headline":"Obscene-How would you define it","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/alka.shrivastava.96","user_linkedin":null,"user_name":"Alka Shrivastava","create_timestamp":"2020-08-23T10:35:29.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1p3gLvE4eYQjIGrRxSK6W2mwQZ_uM6Uok"}],"id":"62"},"__N_SSG":true}