{"pageProps":{"articleData":[{"pk_df_blog_page_id":69,"blog_content":"<p></p><p>\tHealth, hygiene, cleanliness are the words which has remained confined in the pages of the dictionary up till now. People dumping garbage and littering the streets is a common sight, often we ourselves being a part of it. We have ignored people spitting on walls, peeing on roadsides. We have thrown wrappers from cars, buses and trains. But now when we have got immune to all the trashes, when we are not ashamed of dirtying our premises and when we consider cleaning beneath our dignity, this man wielding a broom in his hands has tried to arise our sleeping civic senses by launching high-profile CLEAN INDIA MOVEMENT on Gandhi Jayanti.</p><p>\t</p><p>\tDesire Foundation applauds the excellent initiative taken by our very prime minister Mr. Narendra Damodar Das Modi. Mr. Modi gave the mission a Gandhian touch by asking citizens to participate in the cleanliness drive and donate 2 hours a week in cleaning. It is true that without mass participation and cooperation it is not possible for any government or civic body to keep our country clean. With the support of many celebrities like Aamir Khan, Sachin Tendulkar and other public figures, the mission has been highly acclaimed by people and they are actively supporting the cause so as to accomplish the mission by 2019.</p><p>\tWell, Mr. Modi has tried and done his bit, but the question remains : Are our ministers ready with their plan of action to deal with this problem? Is our Urban Development Minister, Mr. Venkaiah Naidu or Minister of Rural Development, Nitin Gadkari ready to come forward with innovative ideas to build up civic infrastructures in cities and villages ? Is Health Minister, Dr. Harshvardhan ready with technologies to manage medical garbage? Is Anant Gite ready for sustainable development of industries and scientific industrial waste management? The most important question is- Are Indians ready? Will India be able to gift a clean India to Bapu on his 150th birth anniversary?</p><p>\tOf course, this is no easy task but we will be able to achieve this goal only if we have even a little of the faith and hope that Mahatma Gandhi always had in us.</p><p></p>","blog_headline":"‘Swatch Bharat Abhiyan’- Will it become a mere symbolism","user_email":null,"user_insta":null,"user_facebook":null,"user_linkedin":null,"user_name":"Khushboo","create_timestamp":"2020-08-23T10:35:30.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1FhAF8xSykI_pNjppZaUw0c6k2uGVBpU2"}],"id":"69"},"__N_SSG":true}