{"pageProps":{"articleData":[{"pk_df_blog_page_id":7,"blog_content":"<p></p><p>\tIt was a hot summer day when I appeared for Desire Foundation's recruitment. I remember I was the only one who did an on-spot registration. The weather had taken a toll on my health, but my mercury level of excitement was sky-high. And soon enough, after the interview, I got my selection mail. The incredibly warm and friendly team here made me comfortable. In the next couple of weeks, I realized I belonged to a super-talented team. From there my journey started under the guidance of my coordinators and the best mentors I got in the form of our leads.</p><p>\tI remember one day we had gone for a survey and there we found a 4 year old boy. He came running towards me and said œDidi, can I have your pen and paper? At that moment I didn't think of asking him why and gave him my pen and paper. I sat down with him and could see and feel the happiness in him and the excitement to hold the pen to write and draw. Then he posed with a victory sign (unaware of what that pose even meant) and at that moment I realized the day we get him to a school where he'll learn to write, that day will be my real victory.</p><p>\tWith baby steps, I have completed 2 years in this organization. Not only have I grown professionally but also as an individual. In the last 2 years, I've made good friends and have met charismatic leaders (when they address a team they help you get the spark back and motivate you to do your best). I consider myself fortunate enough to have met such talented, inspiring, and enthusiastic leaders whom I've always found to be committed to excellence.</p><p>\tThe world doesn't need any one of us to think small, the world needs us all to dream big, to be bold, and figure out what makes us come alive. Desire Foundation makes me cherish every bit of my life and my dream. The impact of our work might be very trivial compared to the countless issues faced by our society, but we know that big changes come from small steps. And I wish to be a part of this journey through all the challenges.</p><p></p>","blog_headline":"Behind the scenes, Story of a real life Superhero!","user_email":null,"user_insta":"https://instagram.com/sonallata9?igshid=1mdculls0z350","user_facebook":"https://www.facebook.com/sonal.lata.3","user_linkedin":null,"user_name":"Sonal Lata","create_timestamp":"2020-08-23T10:35:19.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1SDon9MHcIin8GmIxpRXi8iPb00Z8ThIh"}],"id":"7"},"__N_SSG":true}