{"pageProps":{"articleData":[{"pk_df_blog_page_id":82,"blog_content":"<p></p><p>\tSo, I was scrolling down my Facebook news feed the other day, when an article caught my attention. After all it had the word RTE in it. Now let me clear a few things for you. First and foremost you would be wondering why I was interested in such an apparently boring acronym.</p><p>\tWell, this acronym holds a special significance to me. I happen to be working in an organization named Desire Foundation which is a government registered trust having a youth cell In KIIT University, Bhubaneswar. Now, one of the main focuses of Desire is to get students from nearby impoverished families admitted to private schools under the RTE(Right to Education Act, silly) under one of their currently ongoing projects named ˜Adhyayan.</p><p>\tThus with curiosity, I clicked on the article link. The first paragraph was enough to catch my attention. œIn India, the loophole has always been central to any law. And so, it seems, is the case with the much-ballyhooed Right of Children to Free and Compulsory Education Act (RTE), which will force private schools to offer at least 25 percent of their seats to the poor. This cast my mind to a recent film titled ˜Hindi Medium which I had the fortune of watching. It portrayed the story of an elite family which used a deep rooted corruption racket to fulfil its wish of admitting their child to the best private school wrongfully, through RTE. I had been stung with disbelief at this injustice and this new article proved to be a bigger eye opener. It seemed that in what can only be described as a œflawed judgement,  the Supreme Court upheld the applicability of the RTE Act to private schools, but curiously excluded unaided minority-run schools from its ambit. In short, the RTE laws primary loophole is the exclusion of minority institutions from its coverage.  Thus, schools are jumping through this loophole to declare themselves minority institutions. Exempting minority unaided institutions from the RTE, is costing thousands of poor children their free education and hence organizations like Desire Foundation seem the need of the hour.</p><p>\tDesire Foundation conducts surveys to find out which child needs the support of RTE and helps them successfully get enrolled in schools under this act. 5 kids have already been admitted to private school this year under RTE and are pursuing their education free of cost. My respect for such organizations has increased tenfold as they are simplifying the task of the government who seem incapable of facing the raw reality.</p><p></p>","blog_headline":"From incredible to educated India - RTE","user_email":null,"user_insta":"https://instagram.com/oishipoddar?igshid=8ijncv882gs9","user_facebook":"https://www.facebook.com/oishi.poddar","user_linkedin":"https://www.linkedin.com/in/oishi-poddar/","user_name":"Oishi Poddar","create_timestamp":"2020-08-23T10:35:33.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=11UBMK_C7nZ0tV2le7HZIUGAEZVvnMlaI"}],"id":"82"},"__N_SSG":true}