{"pageProps":{"articleData":[{"pk_df_blog_page_id":83,"blog_content":"<p></p><p>\tMost of us arent unaware of the great methodologies of Gandhiji during the freedom struggle. He was one of the unique leaders to make contributions to the idea of non-violent resistance, sometimes also called civil resistance. His two main weapons in the fight against the British were truth and non-violence. Surely in the history, this tactics were successful to give us Indians freedom from the clutches of British power but how in a modern era like today would Gandhism favor the lifestyle of individuals.</p><p>\tAfter the attainment of independence, the individuals liberty has increased to a great extent. Sometimes someones freedom can be detrimental to someone elses freedom. So the people might end up developing conflicts and bitterness. Even in a place like home where every family member has their choice and freedom of thoughts, there would be occasions where the younger members viewpoint clashes with the elderly ones. In a situation like that, there are high chances of arguments and discord among the members. So there is a greater need to follow the principles of non-violence.</p><p>\tLikewise, on a wider scenario, the member of the LGBTQ community struggle a lot to find acceptance in the society. If they make use of violence as a technique then there are chances that the country would be in a state of chaos. Principles of ahimsa which has such a deep moral basis would not lose its validity with the passage of time. It is still strong enough to be used by the people to achieve their goals.</p><p>\tHence to use or not to use the tactics used by Gandhi totally depends on the individual ,but if violence, lies and forcible ways are used to attain ones desires ,then surely the whole nation would be in anarchy in no time and the youths would be the first ones to suffer because of their impulsive decisions and actions as a result which would affect the overall progress of the nation.</p><p></p>","blog_headline":"Gandhism in modern India","user_email":null,"user_insta":null,"user_facebook":"https://www.facebook.com/aditi.kar.96742","user_linkedin":null,"user_name":"Aditi Kar","create_timestamp":"2020-08-23T10:35:34.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=13y-63dd_GsZtEKAWrTxA9XiPmwFkbXnU"}],"id":"83"},"__N_SSG":true}