{"pageProps":{"articleData":[{"pk_df_blog_page_id":85,"blog_content":"<p>The&nbsp;<strong>Right to Education Act (RTE)</strong>&nbsp;highlights the importance of free and compulsory education for children between the ages of&nbsp;<strong>6&nbsp;</strong>to&nbsp;<strong>14</strong>&nbsp;under&nbsp;<strong>Article 21a</strong>&nbsp;of the Indian Constitution. This Act states education as a&nbsp;<strong>fundamental right</strong>&nbsp;of every child between ages&nbsp;<strong>6</strong>&nbsp;to&nbsp;<strong>14</strong>. Under this Act&nbsp;all private schools are required to reserve&nbsp;<strong>25%</strong>&nbsp;of seats for these children, which are then to be reimbursed by the state as part of the public-private partnership plan. This Act also prohibits any malpractices by the school authorities during the admission procedure. Upholding the virtue of&nbsp;<strong>education for all</strong>&nbsp;this Act also provides that no child shall be held back, expelled, or required to pass a board examination until the completion of elementary education.&nbsp;</p>\n<p>The&nbsp;<strong>RTE Act</strong>&nbsp;ensures that frequent surveys are conducted in all neighbourhoods to identify children requiring education and providing the necessary facilities for it. It lays down specific responsibilities for the&nbsp;<strong>centre</strong>,&nbsp;<strong>state</strong>&nbsp;and the&nbsp;<strong>local bodies</strong>&nbsp;for smooth and efficient functioning.&nbsp;The&nbsp;<strong>Right to Education Act</strong>&nbsp;lays down certain norms and standards relating to Pupil-Teacher-Ratios, school infrastructure, sanitation, drinking water facility, number of school-working days, working hours of teachers, etc. Each and every elementary school needs to maintain the standard set by the Right to Education Act. The Right to Education Act mandates that a school dropout should be admitted to an appropriate class according to their age and provided with special training to enable the child to come up to age appropriate learning level. The RTE Act provides for the proper deployment of trained teachers maintaining the Student-Teacher Ratio. The Right to Education Act prohibits all kinds of physical punishment and mental harassment, discrimination based on gender, caste, class and religion.</p>\n<p>Here at&nbsp;<strong>Desire Foundation</strong>&nbsp;our vision is fostered towards empowering the underprivileged and promoting social upliftment to build a society devoid of any discrimination where they have access to all the basic amenities of life. We believe that access to quality education is a key factor in achieving our goal which led to the idea of the project named&nbsp;<strong>Adhyayan</strong>. Along similar lines we have other projects such as&nbsp;<strong>KHWAISH-E-SIKSHA</strong>,&nbsp;<strong>AAHAR&nbsp;</strong>and<strong>&nbsp;Liter of Light.&nbsp;</strong>The primary focus of Adhyayan is the correct implementation of&nbsp;<strong>Section 12(1)(c)</strong>&nbsp;of the&nbsp;<strong>RTE Act</strong>&nbsp;which mandates&nbsp;<strong>25%</strong>&nbsp;reservation of children belonging to the&nbsp;<strong>economically and socially weaker sections</strong>&nbsp;of the society in private schools&nbsp;<strong>free of cost</strong>. Despite these facilities as specified under the RTE Act there is a significant lack of awareness among the underprivileged sections about the existence of such laws and as a result of which many children fail to avail these facilities and fail to get access to quality education. Adhyayan strives to bridge this gap and our volunteers go door to door spreading the information of the RTE Act and it&rsquo;s advantages along with creating databases of the eligible children between the ages&nbsp;<strong>3-6</strong>&nbsp;so that they too can avail all these facilities and their children can go to school and get the quality education that they rightfully deserve. We guide parents during the admission procedure with information about the necessary documents required for the admission. We identify the schools along nearby slums within the radius as specified by the RTE Act.</p>\n<p>The journey of Adhyayan began in the year&nbsp;<strong>2016</strong>&nbsp;with&nbsp;<strong>Adhyayan-1</strong>. Under&nbsp;<strong>Adhyayan-1</strong>&nbsp;we visited&nbsp;<strong>2&nbsp;</strong>slums of&nbsp;<strong>Bhubaneshwar</strong>&nbsp;spreading the word of the RTE Act. We were faced with many hurdles initially but we had the sheer determination of braving all odds and were able to enroll students in&nbsp;<strong>2016-17</strong>.&nbsp;<strong>Adhyayan-1</strong>&nbsp;concluded on&nbsp;<strong>1<sup>st</sup>&nbsp;April 2017&nbsp;</strong>with&nbsp;<strong>5</strong>&nbsp;admissions. Our first Adhyayan project gave us the confidence boost we needed and we felt we could bring a difference into the lives of the people of the underprivileged sections of the society.&nbsp;</p>\n<p>We got to learn a lot from&nbsp;<strong>Adhyayan-1</strong>&nbsp;and so in the year&nbsp;<strong>2017</strong>&nbsp;we started with&nbsp;<strong>Adhyayan-2</strong>. Slowly our reach began expanding and our connection with the people of the underprivileged sections grew stronger. Under&nbsp;<strong>Adhyayan-2</strong>&nbsp;we achieved <strong>110&nbsp;</strong>admissions in&nbsp;<strong>2017-18</strong>&nbsp;and&nbsp;<strong>Adhyayan-2</strong>&nbsp;concluded on&nbsp;<strong>31st May,2018</strong>.&nbsp;<strong>Adyayan-3&nbsp;</strong>started in&nbsp;<strong>2018</strong>&nbsp;and we achieved a total of&nbsp;<strong>75&nbsp;</strong>admissions in&nbsp;<strong>2018-19</strong>&nbsp;and&nbsp;<strong>Adhyayan-3</strong>&nbsp;concluded on&nbsp;<strong>30th April,2019</strong>.&nbsp;<strong>Adhyayan-4</strong>&nbsp;was started in&nbsp;<strong>2019&nbsp;</strong>and so far, we have achieved&nbsp;<strong>95&nbsp;</strong>admissions in&nbsp;<strong>2019-2020</strong>. And since then we have never looked back.&nbsp;</p>\n<p>So far we have been able to gradually increase our reach in&nbsp;<strong>Bhubaneshwar</strong>&nbsp;by visiting more and more slums every year. We have covered many slums like&nbsp;<strong>Mahimanagar, Rangamaitia basti</strong>, etc. But we want to reach out to different parts of India and encourage more people to come and join our noble cause. We wish to be able to admit more and more children of the underprivileged sections into the schools.</p>\n<p><strong>Adhyayan-5</strong>&nbsp;was started this year. This year however the&nbsp;<strong>COVID-19</strong>&nbsp;pandemic brought fresh challenges as our team members were no longer able to visit the slums and interact with the people of the underprivileged sections of the society and collect the ground reports and create the database. This meant many children would miss out admission to schools and would lose a chance of getting quality education. But as the saying goes&nbsp;<strong>&ldquo;When the going gets tough, the tough gets going&rdquo;</strong>, we were focussed on our goal. Our team leaders came up with a very unique solution of&nbsp;<strong>work from home</strong>&nbsp;where we could&nbsp;<strong>remotely operate</strong>&nbsp;but still could reach out to the families for admission of their children. Calling tasks were assigned to the team members where we used the existing&nbsp;<strong>databases&nbsp;</strong>created during&nbsp;<strong>Adhyayan-1, Adhyayan-2, Adhyayan-3&nbsp;</strong>and<strong>&nbsp;Adhyayan-4</strong>. Based on those databases our team members began contacting the families by telephonic means. We asked them to provide us with details of any families in their vicinity having children within the ages 3-6 who need access to quality education so that our team could get in contact with them and explain to them about the provisions of the RTE Act. So far, we have collected information about the families having children within the ages 3-6 who need access to quality education. Our next step is contacting these families and helping the fill up the admission forms of the schools. We are hopeful we will succeed in admitting as many children as possible despite all the challenges faces by us this year because we strongly believe&nbsp;<strong>we have the desire to make a difference.</strong></p>","blog_headline":"RTE","user_email":"rick.das.private@gmail.com","user_insta":null,"user_facebook":null,"user_linkedin":null,"user_name":"Rohan Das","create_timestamp":"2020-11-05T06:12:17.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1WqyWPEQBbWYtAZ_DuYa0COZIejljytd7"}],"id":"85"},"__N_SSG":true}