{"pageProps":{"articleData":[{"pk_df_blog_page_id":93,"blog_content":"<p>2020 has been a year which has taken a huge toll on people and economical structures of several countries while significantly endangering the human existence itself. Even though the medical community has been on the frontline of this war against the virus, the recognition of volunteers who supported in the form of paramedics or vaccine trial subjects haven't gone unnoticed.</p>\n<p>5th December which is celebrated as International Volunteers Day Is a day which promotes instilling volunteerism as a value and encourages state parties to recognise the contributions of volunteers and support their efforts in order to achieve Sustainable Development goals.</p>\n<p>This day was mandated by the United Nations in its 1985 General Assembly through Resolution A/RES/40/212 and has been in existence since then. Every year the United Nations Volunteers formalises a campaign for its promotion and focuses on the impact the volunteers have on their communities. In this year, the United Nation wants to bring into picture the difficulties that are encountered by the volunteers and the affirmative impact of their efforts in the communities where they work while sending out the message of Together We Can Work Voluntarily.</p>\n<p>In a recent report on the strategic preparedness and response plan of covid-19, the World Health Organisation identified community volunteers as important stakeholders who actively prevent contact while effectively communicating risk and awareness about the way this virus acts. The <em>UN Deputy Secretary-General Amina J. Mohammed reminded people in opening the GTM2020 in July, 'The efforts of 1 billion volunteers is an important foundation at a pivotal moment for development to enable us to recover from the COVID-19 pandemic'.</em></p>\n<p>Since its inception, this day has been strategically utilised by many countries in order to focus the contribution of volunteers for achieving their Sustainable Development Goals which are a group of time barred targets for fighting hunger, disease, health environmental degradation, gender equality and poverty.</p>\n<p>The organization of International Volunteer Day is generally the result of a partnership between the UN system, governments, volunteer-involving organizations and committed individuals. Representatives from the media or academia, foundations, the private sector, faith groups, and sports and recreational organizations are often involved too.</p>\n<p>The General Assembly invited Governments to observe annually, on 5 December, the International Volunteer Day for Economic and Social Development (resolution 40/212 of 17 December 1985) and urged them to take measures to heighten awareness of the important contribution of volunteer service, thereby stimulating more people in all walks of life to offer their services as volunteers, both at home and abroad.</p>\n<p>In the coming weeks the United Nations Volunteer will be developing a designated web page for the campaign. We should follow their social media channels <a href=\"https://twitter.com/UNVolunteers?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">@UNVolunteers </a>and use the hashtags #TogetherWeCan and #IVD2020 and play an active part of the conversation. The blue heart emoji will be associated with the IVD2020 and contribute to building the campaign image that conveys a positive feeling, solidarity, and compassion toward volunteers</p>","blog_headline":"International Volunteers' Day","user_email":"aarushiagarwal0310@gmail.com","user_insta":null,"user_facebook":"https://www.facebook.com/aarushi.agarwal.39108","user_linkedin":null,"user_name":"Arushi Agarwal","create_timestamp":"2020-12-05T03:29:23.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1kEU8eGtQZ1Le_EdLDp3NXpC9DRCh1Wuf"}],"id":"93"},"__N_SSG":true}