{"pageProps":{"articleData":[{"pk_df_blog_page_id":97,"blog_content":"<p>Midway through this beautiful journey, I would like to recollect and share some of my memories and experiences.</p>\n<p>It all started with an intern badge that I saw on one of my classmate’s bag. (Hint: He is the present Merchandising Coordinator). I came back to my hostel and looked up “Desire Foundation” in the internet. Couldn’t gather much, except, that is an NGO working with children and their education. (The website was nothing like what it is now).\nFortunately, the recruitment was close-by. I applied and went for the interview by just looking at the pictures of the children, a mix of excitement and hope of meeting, interacting, helping them. Most importantly, I went there with almost no preparation at all. I applied for the position of an HR intern, the term was very new for me back then. A year and half passed, I am the present People and Accounts Coordinator. In short, this is the family that has taught me, supported me and helped me grow.</p>\n<p>Cut to the interview. I had a very different perspective towards interviews and seniors. I was truly overwhelmed by the level of comfort that I received from the interviewers.\nFrom the first day, the very first GBM, I got to learn so much. The environment was such that one will be inspired by each and every member of the family. \nI personally was very inspired by how the seniors were narrating their journey and how proud they were. Now, after one and a half years, I can say with pride that I am doing something good for the society and that is with the help of Desire Foundation.\nNow, the most interesting part, slum visits! I was very excited for my very first slum visit. It was in Niladri Vihar. There were numerous new faces whose responsibilities we were taking up and it felt different. A guy who was very reluctant to wake up in the morning for classes was waking up early on Sundays just to meet those children, guide their parents. It became an escape from the hectic college schedule and I started enjoying it very much.</p>\n<p>Next, came the opportunity to visit IIM Ahmedabad. I gave my best on my application. Fortunately was among the very few who got selected. Felt bad for my fellow members as we went for the school visit together and prepared our application. \nIn IIM Ahmedabad, it was a once in a lifetime opportunity to learn from the best minds in this country and also at the same time, represent Desire Foundation and showcase the work we do, at such a great platform. Those 6 days in IIM Ahmedabad were rich with experience, learning and fun.\nThere were so many perspectives that merged at a single place and people shared their views, perceptions. Each day had something in store for us.</p>\n<p>One very important thing I learnt is that we should preserve the people who see the inequalities and actually care, because they are really rare and precious.</p>\n<p>One should be able to listen to others, see through their eyes, then only they will truly be able to help them.\nAs I said, I’m just half way through this beautiful journey and would like to do things that I can imagine of doing right now. Because, what seems impossible aren’t so impossible when you have the right people by your side. I am really thankful to one and all who have guided me, helped and supported me.\nI believe, together, we can do the impossible!</p>","blog_headline":"My Journey Of Ankush Sinha Roy","user_email":"srank2000@gmail.com","user_insta":"https://www.instagram.com/theankewsh.sr/","user_facebook":"https://www.facebook.com/Ankushsiro","user_linkedin":null,"user_name":"Ankush Sinha Roy","create_timestamp":"2020-12-17T05:21:37.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=17rnKprDjlJzrgCWC97ICXbAr89aMCOkH"}],"id":"97"},"__N_SSG":true}