{"pageProps":{"articleData":[{"pk_df_blog_page_id":98,"blog_content":"<p>\"I promised myself that I was going to do everything I could to make a difference. \"</p>\n<p>Not only firmness but a clarity of thoughts is what resemble in these lines spoken by GRETA THUNBERG.Born in a family of Swedish culture on the 3rd of January, 2003 her mother (Malenda Ernman)was an opera singer and her father (Svante Thunberg)an actor by profession .Though she used to remain silent in classes and preferred listening to what was taught,the issue of climate change caught her attention. At the age of 8 years she started realizing the need of taking immediate actions to curb the consequences, and the documentaries and news she saw just stuck in her head and wouldn't let her turn back to normal.</p>\n<p>Finally she took a stand herself for the cause and initiated it with a protest outside Swedish parliament on August 2018,demanding immediate action to combat climate change.Her efforts started showing results when at the age of 16yrs she led the International movement against climate change on 15th March 2019 with over 1.6 million people contributing their share. Greta has been also  honoured with Sweden's alternative Nobel prize -The Right Livelihood Award  for her climate activism .She's a living example that age is just a number, our thoughts and actions define truly what we are and for what we stand .Inspiring many youth personnels out there she's a person of futuristic thinking that has enabled a small change to get started towards the betterment of our own planet,Mother Earth.</p>","blog_headline":"Greta Thunberg - A Bold Voice","user_email":"ronny142000@gmail.com","user_insta":"https://www.instagram.com/debangshu_14?r=nametag","user_facebook":null,"user_linkedin":"https://www.linkedin.com/in/debangshu-chakraborty-124659191","user_name":"Debangshu Chakraborty","create_timestamp":"2019-10-20T10:35:17.000Z","header_img_path":"https://drive.google.com/uc?export=view&id=1-7NM5d0_0DIJbkd32ur4p8e0XYV2G5QG"}],"id":"98"},"__N_SSG":true}